Repository: EFForg/www-l10n
Catalog: translations/*/JobID45_*.xlf
Languages: it

# 887][field_questions][0][question
source: What is Privacy Badger?
it: Cos’è Privacy Badger?

# 887][field_questions][0][answer
source: <a id="what_is_privacy_badger"></a>Privacy Badger is a browser add-on that stops advertisers and other third-party trackers from secretly tracking where you go and what pages you look at on the web. If an advertiser seems to be tracking you across multiple websites without your permission, Privacy Badger automatically blocks that advertiser from loading any more content in your browser. To the advertiser, it's like you suddenly disappeared.
it: <a id="what_is_privacy_badger"></a>Privacy Badger è un componente aggiuntivo che blocca gli inserzionisti e terze parti che segretamente vi stanno tracciando e stanno seguendo le pagine che cercate sul web. Se sembra che un inserzionista stia rilevando su più siti Web senza il vostro permesso, Badger Privacy lo blocca automaticamente e l’inserzionista non potrà più caricare qualsiasi altro contenuto nel vostro browser. Per l’inserzionista, è come se fossi improvvisamente scomparso.

# 887][field_questions][1][question
source: How is Privacy Badger different to Disconnect, Adblock Plus, Ghostery, and other blocking extensions?
it: In cosa Privacy Badger si differenzia da: Disconnect, Adblock Plus, Ghostery e altre estensioni?

# 887][field_questions][1][answer
source: <a id="how_is_it_different"></a>Privacy Badger was born out of our desire to be able to recommend a single extension that would automatically analyze and block any tracker or ad that violated the principle of user consent; which could function well without any settings, knowledge, or configuration by the user; which is produced by an organization that is unambiguously working for its users rather than for advertisers; and which uses algorithmic methods to decide what is and isn't tracking. Although we like Disconnect, Adblock Plus, Ghostery and similar products (in fact Privacy Badger is based on the ABP code!), none of them are exactly what we were looking for. In our testing, all of them required some custom configuration to block non-consensual trackers. Several of these extensions have business models that we weren't entirely comfortable with. And EFF hopes that by developing rigorous algorithmic and policy methods for detecting and preventing non-consensual tracking, we'll produce a codebase that could in fact be adopted by those other extensions, or by mainstream browsers, to give users maximal control over who does and doesn't get to know what they do online.
it: <a id="how_is_it_different"></a>Privacy Badger nasce dal nostro desiderio di essere in grado di creare un’unica estensione che riesce automaticamente ad analizzare e bloccare qualsiasi tracker o annuncio pubblicitario che ha violato il principio del consenso dell’utente. Volevamo creare un estensione che funzionasse bene senza impostazioni, conoscenze particolari o configurazioni da parte dell’utente, che fosse prodotta da un’organizzazione che lavora per i suoi utenti e non per gli inserzionisti, infine la nostra estensione utilizza algoritmi matematici per decidere se un sito che sta e non sta monitorando il vostro comportamento sul web. Anche se a noi piacciono Disconnect, Adblock Plus, Ghostery e prodotti simili (Non a caso Privacy Badger è basato sul codice di ADB!), nessuno di questi fa esattamente ciò che interessa a noi. Nei nostri test, tutti questi richiedono alcune configurazioni per bloccare trackers nascosti. Alcune altre estensioni hanno modelli di business con cui noi non siamo proprio a nostro agio. EFF spera che sviluppando algoritmi e criteri rigorosi per rilevare e impedire il tracciamento senza consenso, si riesca a produrre un codice che in realtà potrebbe essere adottato da altre estensioni, o dai principali browser, per dare agli utenti il massimo controllo su chi sa e chi no ciò che fanno online.

# 887][field_questions][2][question
source: How does Privacy Badger work?
it: Come funziona Privacy Badger?

# 887][field_questions][2][answer
source: <a id="how_does_it_work"></a>When you view a webpage, that page will often be made up of content from many different sources. (For example, a news webpage might load the actual article from the news company, ads from an ad company, and the comments section from a different company that's been contracted out to provide that service.) Privacy Badger keeps track of all of this. If as you browse the web, the same source seems to be tracking your browser across different websites, then Privacy Badger springs into action, telling your browser not to load any more content from that source. And when your browser stops loading content from a source, that source can no longer track you. Voila! At a more technical level, Privacy Badger keeps note of the "third party" domains that embed images, scripts and advertising in the pages you visit. If a third party server appears to be tracking you without permission, by using uniquely identifying cookies (and, as of version 1.0, local storage super cookies and canvas fingerprinting as well) to collect a record of the pages you visit across multiple sites, Privacy Badger will automatically disallow content from that third party tracker. In some cases a third-party domain provides some important aspect of a page's functionality, such as embedded maps, images, or stylesheets. In those cases Privacy Badger will allow connections to the third party but will screen out its tracking cookies and referrers. <p align="right">[<a href="#top">top</a>]</p>
it: <a id="how_does_it_work"></a>Quando si visualizza una pagina Web, tale pagina sarà costituita da contenuti provenienti da fonti diverse. (Ad esempio, una pagina Web di notizie potrebbe caricare l'articolo dalla testata delle notizie, gli annunci da una società ad e la sezione di commenti da un'altra società che è stata contratta fornire tale servizio.) Privacy Badger tiene traccia di tutto questo. Se mentre si naviga sul web, la stessa componente sembra rilevare il vostro browser attraverso diversi siti Web, Privacy Badger entra in azione, raccomandando al tuo browser di non caricare più alcun contenuto da quella fonte. Quando il browser interrompe il caricamento di contenuti da una fonte, questa non può più rintracciarti. Voilà! A un livello più tecnico, Privacy Badger tiene nota dei domini "terzi" che consentono di incorporare immagini, script e pubblicità nelle pagine visitate. Se un server di terze parti sembra rintracciarti senza autorizzazione, utilizzando i cookie (e, a partire dalla versione 1.0, cookies per super archiviazione locale e canvas fingerprinting) per raccogliere un record di pagine visitate su più siti, Privacy Badger automaticamente non consente più il contenuto da quel tracker di terze parti. In alcuni casi un dominio di terze parti fornisce alcuni importanti aspetti della funzionalità di una pagina, ad esempio mappe incorporate, immagini o fogli di stile. In quei casi Privacy Badger permetterà connessioni a terzi ma taglierà i relativi cookie traccianti e referrer. <p align="right">[<a href="#top">Torna in cima</a>]</p>

# 887][field_questions][3][question
source: What is a third party tracker?
it: Che cos'è un tracker di terze parti?

# 887][field_questions][3][answer
source: <a id="trackers"></a>When you visit a webpage parts of the page may come from domains and servers other than the one you asked to visit. This is an essential feature of <a href="https://en.wikipedia.org/wiki/Hypertext">hypertext</a>, but it has also come to be a serious privacy problem. On the modern Web, embedded images and code often use cookies and other methods to track your browsing habits — often to display advertisements. The domains that do this are called "third party trackers", and you can read more about how they work <a href="https://www.eff.org/deeplinks/2009/09/online-trackers-and-social-networks">here</a>.
it: <a id="trackers"></a>Quando visiti una pagina Web alcune parti della pagina possono provenire da domini o server diversi da quelli che hai chiesto di visitare. Questa è una caratteristica essenziale degli <a href="https://en.wikipedia.org/wiki/Hypertext">ipertesti</a>, ma è anche un serio problema per la privacy. Nel moderno Web, immagini incorporate e parti di codice spesso utilizzano cookie e altri metodi per tracciare le tue abitudini sul web - di solito per mostrarti pubblicità. I domini che fanno ciò sono detti "trackers", puoi leggere di più riguardo a questi tracker <a href="https://www.eff.org/deeplinks/2009/09/online-trackers-and-social-networks">qui</a>.

# 887][field_questions][4][question
source: What do the red, yellow and green sliders in the Privacy Badger menu mean?
it: Che cosa significano i cursori rossi, gialli e verdi nel menu Privacy Badger?

# 887][field_questions][4][answer
source: <a id="what_do_the_colors_mean"></a>The colors mean the following: <ul><li>Green means there's a third party domain, but it hasn't yet been observed tracking you across multiple sites, so it might be unobjectionable. When you first install Privacy Badger every domain will be in this green state but as you browse, domains will quickly be classified as trackers.</li> <li>Yellow means that the third party domain appears to be trying to track you, but it is on Privacy Badger's cookie-blocking "yellowlist" of third party domains that, when analyzed, seemed to be necessary for Web functionality. In that case, Privacy Badger will load content from the domain but will try to screen out third party cookies and referrers from it.</li> <li>Red means that content from this third party tracker has been completely disallowed.</li> </ul> Privacy Badger analyzes each third party's behavior over time, and picks what it thinks is the right setting for each domain, but you can adjust the sliders if you wish.
it: <a id="what_do_the_colors_mean"></a>I colori hanno il seguente significato: <ul><li>Verde significa che c’è un dominio di terze parti, ma non è ancora stato scoperto a tracciarti su più siti, perciò è tutto ok. Appena installi Privacy Badger tutti i domini saranno verdi, ma pian piano che navighi i trackers verranno riconosciuti.</li> <li>Giallo sigifica che un dominio di terze parti sta cercando di tracciarti, ma è nella "yellowlist" di Privacy Badger e perciò sembra essere necessario per il funzionamento del sito. In questo caso Privacy Badger caricherà il suo contenuto, ma cercherà di tenere lontano altri cookie di terze parti che si riferiscono a lui.</li> <li>Rosso significa che il contenuto di quel tracker è stato completamente bloccato.</li> </ul> Badger privacy analizza il comportamento di ognuno dei cookie di terze parti nel corso del tempo e imposta ciascun dominio in base a come pensa possa essere meglio, ma è possibile regolare manualmente i cursori se lo si desidera.

# 887][field_questions][5][question
source: Why does Privacy Badger block ads?
it: Perchè Privacy Badger Blocca le pubblicità?

# 887][field_questions][5][answer
source: <a id="why_does_privacy_badger_block_ads"></a>Actually, nothing in the Privacy Badger code is specifically written to block ads. Rather, it focuses on disallowing any visible or invisible "third party" scripts or images that appear to be tracking you even though you specifically denied consent by sending a Do Not Track header. It just so happens that most (but not all) of these third party trackers are advertisements. When you see an ad, the ad sees you, and can track you. Privacy Badger is here to stop that.
it: <a id="why_does_privacy_badger_block_ads"></a>In realtà, nulla nel codice di Privacy Badger è scritto specificatamente per bloccare le pubblicità. Piuttosto, si concentra per impedire qualsiasi script visibile o invisibile di "terze parti" o le immagini che sembrano essere di monitoraggio, anche se non richieste. E così capita che la maggior parte (ma non tutte) di queste terze parti sono pubblicità. Quando tu vedi un annuncio, l'annuncio vede te e può rintracciarti. Sulla privacy Badger è qui per impedirlo.

# 887][field_questions][6][question
source: Why doesn't Privacy Badger block all ads?
it: Perché Badger Privacy non blocca tutti gli annunci?

# 887][field_questions][6][answer
source: <a id="why_doesnt_privacy_badger_block_all_ads"></a>Because Privacy Badger is primarily a privacy tool, not an ad blocker. Our aim is not to block ads, but to prevent non-consensual invasions of people's privacy because we believe they are inherently objectionable. We also want to create incentives for advertising companies to do the right thing. Of course, if you really dislike ads, you can also install a traditional ad blocker.<a name="dnt-policy"></a>
it: <a id="why_doesnt_privacy_badger_block_all_ads"></a>Perché Privacy Badger è uno strumento che riguarda la privacy, non un adblocker. Il nostro scopo non è quello di bloccare le pubblicità, ma quello di prevenire invasioni della privacy senza consenso, perché le riteniamo discutibili. Vogliamo anche creare incentivi per aziende pubblicitarie fare la cosa giusta. Ovviamente, se davvero non ti piacciono le pubblicità puoi installare un adblocker tradizionale.<a name="dnt-policy"></a>

# 887][field_questions][7][question
source: What about tracking by the sites I actively visit, like NYTimes.com or Facebook.com?
it: Riguardo a siti che visito spesso come NYTimes.com o Facebook.com?

# 887][field_questions][7][answer
source: <a id="what_about_first_party_tracking"></a>For the time being, Privacy Badger only protects you against tracking by third party sites. In the future we plan to add some privacy protections for "first party" sites that you actually visit. We are doing things in this order because the most scandalous, intrusive and objectionable form of online tracking is that conducted by companies you've <a href="http://mediamemo.allthingsd.com/files/2010/09/LUMA-display-ad-map.jpg">often never heard of</a> and have no relationship with. First and foremost, Privacy Badger is there to enforce Do Not Track against these domains by providing the technical means to restrict access to their tracking scripts and images. The right policy for whether nytimes.com, facebook.com or google.com can track you <i>when you visit that site</i> – and the technical task of preventing it – is more complicated because often (though not always) tracking is interwoven with the features the site offers, and sometimes (though not always) users may understand that the price of an excellent free tool like Google's search engine is measured in privacy, not money.
it: <a id="what_about_first_party_tracking"></a>Per ora Privacy Badger protegge solo da trackers di terze parti. In futuro abbiamo in programma di aggiungere alcune protezioni per i siti “prime parti”. stiamo facendo questo perché le più scandalose, intrusive e discutibili forme di tracking sono portate avanti da società di cui <a href="http://mediamemo.allthingsd.com/files/2010/09/LUMA-display-ad-map.jpg">spesso non hai sentito parlare</a> e con cui non hai nessun rapporto. Innanzitutto, Privacy Badger è lì per far valere la non tracciabilità nei confronti di questi domini, fornendo i mezzi tecnici per limitare l'accesso ai loro script di monitoraggio e le immagini. Il giusto che siti come nytimes.com, facebook.com o google.com devono tenere <i>quando visiti questi siti</i> e il compito tecnico di prevenzione sono più complicato perché spesso (anche se non sempre) il rilevamento si intreccia con le caratteristiche del sito, e a volte (anche se non sempre) gli utenti possono capire che il prezzo di un ottimo strumento gratuito come motore di ricerca di Google è misurato nel rispetto della privacy , non il denaro.

# 887][field_questions][8][question
source: Does Privacy Badger contain a "black list" of blocked sites?
it: Privacy Badger contiene una "lista nera" dei siti bloccati?

# 887][field_questions][8][answer
source: <a id="is_there_a_black_list"></a>No, unlike other blocking tools like AdBlock Plus, we have not made decisions about which sites to block, but rather about which behavior is objectionable. Domains will only be blocked or screened if the Privacy Badger code inside your browser actually observes the domain collecting unique identifiers after it was sent a Do Not Track message. Privacy Badger <i>does</i> contain a "<a href="https://github.com/EFForg/privacybadgerchrome/blob/master/doc/sample_cookieblocklist.txt">yellowlist</a>" of some sites that are known to provide essential third party resources; those sites show up as yellow and have their cookies blocked rather than being blocked entirely. This is a compromise with practicality, and in the long term we hope to phase out the yellowlist as these third parties begin to <a href="/dnt-policy">explicitly commit to respecting Do Not Track</a>. The criteria for including a domain on the yellowlist can be <a href="https://github.com/EFForg/privacybadgerchrome/blob/master/yellowlist-criteria.txt" target="_blank">found here</a>.
it: <a id="is_there_a_black_list"></a>No, al contrario di altri strumenti per bloccare le pubblicità come AdBlock Plus, non abbiamo deciso quali siti bloccare, ma piuttosto quali comportamenti siano discutibili. I domini saranno bloccati o filtrati se il codice di Privacy Badger all’interno del browser osserva che il dominio sta raccogliendo gli identificatori univoci dopo che è stato inviato un messaggio di non tracciabilità. Privacy Badger <i>contiene</i>una "<a href="https://github.com/EFForg/privacybadgerchrome/blob/master/doc/sample_cookieblocklist.txt">yellowlist</a>" di alcuni siti che sono noti per fornire risorse essenziali da terze parti; questi siti sono mostrati in giallo e sono bloccati parzialmente. Questo è un compromesso con la praticità, nel tempo speriamo di eliminare la yellowlist <a href="/dnt-policy">quando le terze parti cominceranno a rispettare il Do Not Track</a>. I criteri per entrare in una “yellowlist” sono <a href="https://github.com/EFForg/privacybadgerchrome/blob/master/yellowlist-criteria.txt" target="_blank">qui</a>.

# 887][field_questions][9][question
source: How was the cookie blocking yellowlist created?
it: Come è stata creata la yellowlist.

# 887][field_questions][9][answer
source: <a id="how_was_the_white_list_created"></a>The initial list of domains that should be cookie blocked rather than blocked entirely was derived from a <a href="https://jonathanmayer.org/papers_data/bau13.pdf">research project</a> on classifying third party domains as trackers and non-trackers. We will make occasional adjustments to it as necessary. If you find domains that are under- or over-blocked, please <a href="https://github.com/EFForg/privacybadgerchrome/issues">file a bug</a> on Github.
it: <a id="how_was_the_white_list_created"></a>La lista iniziale di domini da bloccare in parte o parzialmentederiva da un <a href="https://jonathanmayer.org/papers_data/bau13.pdf">progetto di ricerca</a> riguardo la classificazione di domini come trackers o non-trackers. Faremo occasionali modifiche ad esso come necessario. Se trovi domini sovra o sotto bloccati, per favore <a href="https://github.com/EFForg/privacybadgerchrome/issues">segnala un bug</a> su Github.

# 887][field_questions][10][question
source: Does Privacy Badger prevent fingerprinting?
it: Privacy Badger previene fingerprinting?

# 887][field_questions][10][answer
source: <a id="does_it_prevent_fingerprinting"></a>Browser fingerprinting is an extremely subtle and problematic method of tracking, which we <a href="https://panopticlick.eff.org">documented with the Panopticlick project</a>. Privacy Badger 1.0 can detect <a href="http://janhkrueger.de/gitpup/RSSArtikel/raw/bd53c81bd5d1ee434d76a64ece26de1aac3a218d/w2sp12-final4.pdf" target="_blank">canvas</a> <a href="http://filelifter.de/assets/plugindata/poola/thewebneverforgets.pdf" target="_blank">based</a> <a href="https://www.propublica.org/article/meet-the-online-tracking-device-that-is-virtually-impossible-to-block" target="_blank">fingerprinting</a>, and will block third party domains that use it. Detection of other forms of fingerprinting and protections against first-party fingerprinting are ongoing projects. Of course, once a domain is blocked by Privacy Badger, it will no longer be able to fingerprint you as a third-party.
it: <a id="does_it_prevent_fingerprinting"></a>Il Browser fingerprinting è un’attività estremamente subdola e un metodo problematico per tracciarti, noil’abbiamo documentato <a href="https://panopticlick.eff.org">con il progetto Panopticlick</a>. Privacy Badger 1.0 può trovare <a href="http://janhkrueger.de/gitpup/RSSArtikel/raw/bd53c81bd5d1ee434d76a64ece26de1aac3a218d/w2sp12-final4.pdf" target="_blank">canvas</a> <a href="http://filelifter.de/assets/plugindata/poola/thewebneverforgets.pdf" target="_blank">basati</a>sul <a href="https://www.propublica.org/article/meet-the-online-tracking-device-that-is-virtually-impossible-to-block" target="_blank">fingerprinting</a>, e bloccherà domini che lo usano. Il rilevamento di altre forme di fingerprinting e protezioni controil fingerprinting sono parte di progetti in corso. Naturalmente, una volta che un dominio è bloccato da Privacy Badger, non sarà in grado seguirti.

# 887][field_questions][11][question
source: Does Privacy Badger consider every cookie to be a tracking cookie?
it: Privacy Badger ritiene ogni cookie un tracking cookie?

# 887][field_questions][11][answer
source: <a id="is_every_cookie_a_tracking_cookie"></a>No. Privacy Badger analyzes the cookies from each site; unique cookies that contain tracking IDs are disallowed, while "low entropy" cookies that perform other functions are allowed. For instance a cookie like LANG=fr that encodes the user's language preference, or a cookie that preserves a very small amount of information about ads the user has been shown, would be allowed provided that individual or small groups of users' reading habits could not be collected with them. We have a <a href="https://github.com/EFForg/privacybadgerchrome/blob/master/src/heuristicblocking.js#l482">very rough</a> implementation of this; pull requests are welcome.
it: <a id="is_every_cookie_a_tracking_cookie"></a>No. Privacy Badger analizza i cookie da ogni sito; i cookie che ti tracciano vengono disattivati, mentre quelli a “bassa entropia” che svolgono funzioni utili vengono lasciati. Per esempio un cookie come LANG = it che codifica la lingua preferita, o un cookie che conserva una piccola quantità di informazioni su ads, sono permessi perché individuali e perché raccolgono abitudini di lettura degli utenti che non possono essere ricondotte a loro. Abbiamo un’implementazione <a href="https://github.com/EFForg/privacybadgerchrome/blob/master/src/heuristicblocking.js#l482">molto caotica</a> perciò interventi degli utenti sono benvenuti.

# 887][field_questions][12][question
source: Does Privacy Badger account for a cookie that was used to track me even if I deleted it?
it: Badger Privacy tiene conto di un cookie che è stato utilizzato per tenere traccia di me anche se l’ho cancellato?

# 887][field_questions][12][answer
source: <a id="what_about_deleted_cookies"></a>Yes. Privacy Badger keeps track of cookies that could be used to track you and where they came from, even if you frequently clear your browser's cookies.
it: <a id="what_about_deleted_cookies"></a>Si. Privacy Badger tiene traccia dei cookie che potrebbero essere utilizzati per tenere traccia dell'utente e da dove arrivano, anche se si cancellano spesso i cookie del browser.

# 887][field_questions][13][question
source: Will you be supporting any other browsers besides Chrome / Firefox?
it: Sosterrete altri browser oltre a Chrome / Firefox?
