Repository: EFForg/www-l10n
Catalog: translations/*/JobID43_*.xlf
Languages: de

# 863][field_questions][15][answer
source: <a id="how_to_comply_with_dnt"></a>One way is to stop tracking third party users who have turned on the Do Not Track header (i.e., stop collecting cookies, supercookies or fingerprints from them). That will work for new Privacy Badger installs. If copies of Privacy Badger have already blocked your domain, you can unblock yourself by promising to respect the Do Not Track header in a way that conforms with the user's privacy policy. You can do that by posting a specific compliant <a href="https://www.eff.org/dnt-policy" target="_blank">DNT policy</a> to the URL <tt>http<b>s</b>://example.com/.well-known/dnt-policy.txt</tt>, where "example.com" is all of your DNT-compliant domains. Note that the domain <i>must</i> support HTTPS, to protect against tampering by network attackers. The path contains ".well-known" per <a href="https://tools.ietf.org/html/rfc5785">RFC 5785</a>. Privacy Badger currently checks for this specific <i>verbatim</i> policy document, though in the future Privacy Badger may allow content from sites that post different versions of a <a href="/dnt-policy">compliant DNT Policy</a>, and that there may be ways for users to specify their own acceptable DNT policies if they wish to.
de: <a id="how_to_comply_with_dnt"></a>Eine Möglichkeit ist es Benutzer die Do not track, durch mitteilen in der Kopfzeile, eingeschaltet haben nicht mehr zu tracken (z.B. aufhören Cookies, Supercookies oder Fingerabdrücke von ihnen zu sammeln). Bei neuen Installationen von Privacy Badger wird dann nicht mehr geblockt. Wenn schon bestehende Installationen von Privacy Badger die Seite schon blockieren, kann das blockieren ausgeschaltet werden wenn versichert wird das eine Do Not Track Kopfzeile in der Form berücksichtigt wird wie der Benutzer es wünscht. Um dies zu tun kannst Du einen Antrag auf <a href="https://www.eff.org/dnt-policy" target="_blank">DNT policy</a> to the URL <tt>http<b>s</b>://example.com/.well-known/dnt-policy.txt</tt> stellen, wobei "example" alle deine Domains sind die Do Not Track umsetzen sind.

# 863][field_questions][16][question
source: What is the Privacy Badger license? Where is the Privacy Badger source code?
de: Unter welcher Lizenz steht Privacy Badger? Wo kann ich den Source Code finden?

# 863][field_questions][16][answer
source: <a id="license"></a>Privacy Badger is GPLv3 code, the Chrome version is based on a modified version of the AdBlock Plus engine. You can find the Privacy Badger source trees <a href="https://github.com/EFForg/">on Github</a>. There is also a <a href="https://lists.eff.org/mailman/listinfo/privacybadger">development mailing list</a>. Privacy Badger is governed by EFF's <a href="/code/privacy">Privacy Policy for Software</a>. <a name="comparison"></a>
de: <a id="license"></a>Privacy Badger steht unter der GPLv3, die Chrome Version basiert auf einer modifizieren Version von AdBlock Plus. Den Source Code von Privacy Badger findest Du hier <a href="https://github.com/EFForg/">auf Github</a>. Zusätzlich gibt es noch die <a href="https://lists.eff.org/mailman/listinfo/privacybadger">Entwickler Mailingliste</a>. Für Privacy Badger gelten die Regeln unser <a href="/code/privacy">Privacy Policy for Software</a>. <a name="comparison"></a>

# 863][field_questions][17][question
source: I found a bug! What do I do now?
de: Ich habe einen Fehler gefunden! Was mache ich jetzt?

# 863][field_questions][17][answer
source: <a id="i_found_a_bug"></a>First, please make sure the bug hasn't already been reported by checking the current bug list <a href="https://github.com/EFForg/privacybadgerfirefox/issues">for Firefox</a> or <a href="https://github.com/EFForg/privacybadgerchrome/issues">for Chrome</a>. If the bug hasn't yet been reported you can report the bug <a href="https://github.com/EFForg/privacybadgerfirefox/issues/new">here for Privacy Badger for Firefox</a> or <a href="https://github.com/EFForg/privacybadgerchrome/issues/new">here for Privacy Badger for Chrome</a>. If you don't have a GitHub account, then you can login using the anonymous one: "cypherpunk"/"cypherpunk", but please understand that doing so will limit our ability to communicate with you about the bug and make it harder for us to fix it quickly.
de: <a id="i_found_a_bug"></a>Erstens, schaue nach ob der Fehler nicht schon gemeldet wurde, alle uns bekannten Fehler können hier <a href="https://github.com/EFForg/privacybadgerfirefox/issues">für Firefox</a> oder <a href="https://github.com/EFForg/privacybadgerchrome/issues">Chrome</a> eingesehen werden. Wenn uns der Fehler noch nicht mitgeteilt worden ist kannst Du ihn uns (bitte in Englisch) <a href="https://github.com/EFForg/privacybadgerfirefox/issues/new">hier für Firefox</a> und <a href="https://github.com/EFForg/privacybadgerchrome/issues/new">Hier für Chrome</a> mitteilen. Wenn Du keinen GitHub Account hast kannst du dich auch Anonym anmelden, Benutzername=cypherpunk; Passwort=cypherpunk. Wenn Du den Fehler Anonym meldest können wir uns nicht mit dir, wegen des Fehler, in Verbindung setzen und dadurch wird es für uns schwerer den Fehler zu beheben.

# 863][field_questions][18][question
source: How can I support Privacy Badger?
de: Wie kann ich Privacy Badger unterstützen?

# 863][field_questions][18][answer
source: <a id="support"></a>Thanks for asking! Individual donations make up about half of EFF's support, which gives us the freedom to work on user-focused projects. If you want to support the development of Privacy Badger and other projects like it, helping build a more secure Internet ecosystem, you can <a href="https://supporters.eff.org/donate/support-privacy-badger">throw us a few dollars here</a>. Thank you. If you want to help with the code we appreciate that as well. Here are the lists of good volunteer tasks <a href="https://github.com/EFForg/privacybadgerfirefox/issues?q=is%3Aopen+is%3Aissue+label%3A%22Good+Volunteer+Task%22" target="_blank">[firefox]</a> <a href="https://github.com/EFForg/privacybadgerchrome/issues?q=is%3Aopen+is%3Aissue+label%3A%22Good+Volunteer+Task%22" target="_blank">[chrome]</a>.
de: <a id="support"></a>Vielen dank für das Interesse! Spenden von Privatpersonen machen circa die Hälfte der Spenden an die RFF aus, das gibt uns die die Freiheit um an Projekten für den Endanwender zu arbeiten. Wenn Du die Entwicklung von Privacy Badger und ähnlichen Projekten, die helfen ein sichereres Internet zu bauen, kannst Du uns hier <a href="https://supporters.eff.org/donate/support-privacy-badger">ein paar Euro spenden</a>, Wir danken dir dafür. Wenn Du bei der Programmierung helfen möchtest würden wir uns auch sehr darüber freuen. Hier ist eine Liste von Aufgaben die noch erledigt werden müssen <a href="https://github.com/EFForg/privacybadgerfirefox/issues?q=is%3Aopen+is%3Aissue+label%3A%22Good+Volunteer+Task%22" target="_blank">[firefox]</a> <a href="https://github.com/EFForg/privacybadgerchrome/issues?q=is%3Aopen+is%3Aissue+label%3A%22Good+Volunteer+Task%22" target="_blank">[chrome]</a>.

# 863][field_questions][19][question
source: How does Privacy Badger handle social media widgets?
de: Was macht Privacy Badger mit Widgets von sozialen Netzwerken?

# 863][field_questions][19][answer
source: <a id="social"></a>Social media widgets (such as the Facebook Like button, Twitter Tweet button, or Google +1 button) often track your reading habits. Even if you don't click them, the social media companies often see exactly which pages you're seeing the widget on. Privacy Badger includes a feature imported from the <a href="http://sharemenot.cs.washington.edu/">ShareMeNot</a> project which is able to replace the widgets with a stand-in version, so that you can still see and click them. You will not be tracked by these replacements unless you explicitly choose to click them. Privacy Badger currently knows how to replace the following widgets if they are observed tracking you: AddThis, Facebook, Google, LinkedIn, Pinterest, Stumbleupon, and Twitter. (The source code for these replacements is <a href="https://github.com/EFForg/privacybadgerchrome/blob/master/src/socialwidgets.json">here</a>; pull requests are welcome) Note that Privacy Badger will not replace social media widgets unless it has blocked the associated tracker. If you're seeing real social media widgets, it generally means that Privacy Badger hasn't detected tracking from that variant of the widget, or that the site you're looking at has implemented its own version of the widget. To avoid confusion, the replacement widgets are marked with the Privacy Badger badge next to the button. To interact with a replacement widget, simply click on it. Depending on the widget, Privacy Badger will either send you directly to the appropriate sharing page (for example, to post a tweet) or it will enable and load the real social widget (for example, the Facebook Like button, with personalized information about how many of your friends have "liked" the page). In the second case, you will still need to interact with the real widget to "like" or share the page. <a id="connection-failure"></a>
de: <a id="social"></a>Widgets von sozaialen Netzwerken (wie der Facebook Like Button, Twitter Tweet Button oder der Google +1 Button) tracken oft dein surf Verhalten, auch wenn Du sie nicht klickst. In den meisten fällen können diese Firmen sehen auf welchen Seiten dir das Widget angezeigt wird. Privacy Badger hat eine Funktion vom <a href="http://sharemenot.cs.washington.edu/">ShareMeNot</a> Projekt eingebaut, damit werden diese Wigets durch eine andere Version ersetzt die man immer noch sehen und auch benutzen kann. Die neue Version erlauben es den Firmen aber nicht dich zu tracken bis Du dich aktiv dazu entscheidest sie zu klicken. Wenn festgestellt wird das solche Wigets dich tracken kann Privacy Badger folgende Wigets austauschen: AddThis, Facebook, Google, LinkedIn, Pinterest, Stumbleupon, and Twitter. (Der Quellcode für die neuen Versionen findet Du <a href="https://github.com/EFForg/privacybadgerchrome/blob/master/src/socialwidgets.json">hier</a>; pull requests sind Willkommen.) Privacy Badger tauscht die Widgets nur aus wenn der dazugehörige Tracker geblockt wurde. Wenn Du also ein "richtiges" Widget sieht heißt das das Privacy Badger nicht festgestellt hat das DU auf dieser Seite getracked wirst. Um Verwechselungen auszuschließen haben die Ausgetauschten Widgets ein kleines Privacy Badger Symbol neben dem Widget. Um das ausgetauschte Widget zu benutzen klicke einfach drauf. Abhängig vom Widget sendet dich Privacy Badger direkt zur richtigen Seite (z.B. wenn Du etwas Twittern willst) oder es aktiviert und lädt das original Widget (z.B. Der Facebook Like Button, der dir auch die Information anzeigt wie viele deiner Freunde die Seite geliked haben). Im zweiten Fall musst Du dann noch einmal auf das Widget klicken umd die Seite zu liken oder zu teilen.<a id="connection-failure"></a>

# 863][field_questions][20][question
source: I'm having a problem installing the browser extension.
de: Ich habe ein Problem bei der Installation des Browser Addons.

# 863][field_questions][20][answer
source: Some people report that installing Privacy Badger gives them the error: "The addon could not be downloaded because of a connection failure on www.eff.org." This may be caused by Avast antivirus, which blocks installation of browser extensions. You may be able to work around by right-clicking to download the .xpi file, then dragging it into Firefox to install. If that fails, you may temporarily disable Avast antivirus before installing the extension.
de: Manche Personen haben uns berichtet das sie bei der Installation von Privacy Badger folgenden Fehler bekommen: "Die Erweiterung kann nicht herunter geladen werden da die Verbunding zu www.eff.org fehlgeschlagen ist". Der Grund hierfür kann bei Avast Antivirus liegen, da es die Installation von Browser Erweiterungen blockiert. Dies kann man in den meisten Fällen umgehen indem man durch einen rechts Klick die .xpi Datei herunterlädt und diese dann in Firefox herein zieht. Wenn das nicht funktioniert, kannst du Avast vor der Installation aus schalten und danach wieder einschalten.

# 863][field_questions][21][question
source: Is Privacy Badger compatible with other extensions, including other adblockers?
de: Ist Privacy Badger zu anderen Browser Erweiterungen, auch andere Werbeblocker, kompatibel?

# 863][field_questions][21][answer
source: Privacy Badger is compatible with most extensions. Whether it makes sense to run it with another adblocker varies. If you have customized your adblocker settings to block trackers as well, Privacy Badger may be partially redundant (though it may offer advantages like cookie blocking that other tracker blockers do not). However if you run extensions like Adlbock Plus or Ghostery in their default configurations, Privacy Badger can significantly increase your privacy online. (Adblock does not block invisible trackers by default, Ghostery does not block anything by default.) The only extensions known to be incompatible with Privacy Badger is the Avast anitvirus extension, which blocks the installation of Privacy Badger and other extensions. Last updated July 22nd, 2015
de: Privacy Badger ist kompatibel mit den meistern Erweiterungen. Ob es auch sinnvoll ist es mit anderen Werbeblockern zu benutzten hängt vom Einzelfall ab. Wenn Du deinen Werbeblocker so eingestellt hast das er auch tracker blockiert wird Privacy Badger in gewissen Aspekten nutzlos (aber es bietet vielleicht auch noch Vorteile wie das Blockieren von Cookies was andere Erweiterungen vielleicht nicht machen). Wenn Du aber Erweiterungen wie wie Adblock Plus oder Ghostery mit ihren Grundeinstelllungen benutzt erhöht Privacy Badger deine Privatsphäre im Internet. (Adblock blockiert keine unsichtbaren Tracker in der Grundeinstellung, Ghostersy blockiert in der Grundeinstellung gar nichts.) Die einzige Erweiterung von der uns bekannt ist das sie nicht mit Privacy Badger funktioniert ist die Avast Antivirus Erweiterung, Sie blockiert die Installation von Privacy Badger und anderen Erweiterungen. Stand 22 Juli 2015

# 864][field_text_field][0][value
source: A Project of the <a href="/">Electronic Frontier Foundation</a>
de: Ein Projekt der <a href="/">}Electronic Frontier Foundation</a>

# 865][singular
source: Privacy Badger blocks spying ads and invisible trackers.
de: Privacy Badger blockiert spionierende Werbung und unsichtbare Tracker.

# 867][singular
source: Install Privacy Badger
de: Installiere Privacy Badger

# 869][singular
source: and Enable Do Not Track
de: schalte

# 870][singular
source: Click here for !browser version
de: Hier Klicken für !browser version

# 873][singular
source: Download for Firefox
de: Herunterladen für Firefox

# 874][singular
source: Download for Chrome
de: Herunterladen für Chrome
