Repository: EFForg/www-l10n
Catalog: translations/*/JobID43_*.xlf
Languages: de

# 863][field_questions][0][question
source: What is Privacy Badger?
de: Was ist Privacy Badger?

# 863][field_questions][0][answer
source: <a id="what_is_privacy_badger"></a>Privacy Badger is a browser add-on that stops advertisers and other third-party trackers from secretly tracking where you go and what pages you look at on the web. If an advertiser seems to be tracking you across multiple websites without your permission, Privacy Badger automatically blocks that advertiser from loading any more content in your browser. To the advertiser, it's like you suddenly disappeared.
de: <a id="what_is_privacy_badger"></a>Privacy Badger ist ein Browser Add-on. Es stoppt Werbeanbieter und andere Anbieter von Trackern, die ohne dein Wissen, ein Bewegungsprofil von Dir im Internet erstellen. Wenn ein Werbeanbieter dich ohne deine Zustimmung über mehrere Seiten hinweg tracked, verhindert Privacy Badger das der Werbeanbieter mehr Daten an deinen Browser schicken kann. Für den Werbeanbieter sieht es so als als wärst Du nicht mehr online.

# 863][field_questions][1][question
source: How is Privacy Badger different to Disconnect, Adblock Plus, Ghostery, and other blocking extensions?
de: Wie unterscheidet sich Privaxy Badger zu Disconnect, Adblock Plus, Ghostery und anderen blocker Extension?

# 863][field_questions][1][answer
source: <a id="how_is_it_different"></a>Privacy Badger was born out of our desire to be able to recommend a single extension that would automatically analyze and block any tracker or ad that violated the principle of user consent; which could function well without any settings, knowledge, or configuration by the user; which is produced by an organization that is unambiguously working for its users rather than for advertisers; and which uses algorithmic methods to decide what is and isn't tracking. Although we like Disconnect, Adblock Plus, Ghostery and similar products (in fact Privacy Badger is based on the ABP code!), none of them are exactly what we were looking for. In our testing, all of them required some custom configuration to block non-consensual trackers. Several of these extensions have business models that we weren't entirely comfortable with. And EFF hopes that by developing rigorous algorithmic and policy methods for detecting and preventing non-consensual tracking, we'll produce a codebase that could in fact be adopted by those other extensions, or by mainstream browsers, to give users maximal control over who does and doesn't get to know what they do online.
de: <a id="how_is_it_different"></a>Privacy Badger wurde aus der Idee heraus geboren eine einzige Extension anzubieten die: Traker oder Werbung automatisch analysiert und blockiert wenn sie dem Benutzer keine Entscheidungsfreiheit lassen; die keine Einrichtung, Vorwissen oder Einstellungen erfordert; durch eine Organisation bereit gestellt werden die sich nur für die Rechte der Verbraucher einsetzt; durch Algorithmen entscheidet ob es sich um Tracker handelt oder nicht. Auch wenn wir Projekte wie Disconnect, Adblock Plus, Ghostery und ähnliche Anwendungen mögen, (Privacy Badger basiert auf dem ADB Code!), hat keines unsere Vorstellung erfüllt. In unseren Test benötigten alle Alternativen nachträgliche Einstellungen um Tracker denen du nicht zugestimmt hast zu blocken. Einige haben Geschäftsmodelle die nicht vertrauenswürdig sind. Wir die EFF glauben das wir mit der Entwicklung von rigorosen Algorithmus und Methoden um unfreiwilliges Tracking zu erkennen und zu verhindern, eine Grundlage schaffen die von den anderen Anwendungen oder Browsern verwendet werden kann. Damit der Benutzer die volle Kontrolle darüber hat wer und wer nicht sehen darf was er online macht.

# 863][field_questions][2][question
source: How does Privacy Badger work?
de: Wie funktioniert Privacy Badger?

# 863][field_questions][2][answer
source: <a id="how_does_it_work"></a>When you view a webpage, that page will often be made up of content from many different sources. (For example, a news webpage might load the actual article from the news company, ads from an ad company, and the comments section from a different company that's been contracted out to provide that service.) Privacy Badger keeps track of all of this. If as you browse the web, the same source seems to be tracking your browser across different websites, then Privacy Badger springs into action, telling your browser not to load any more content from that source. And when your browser stops loading content from a source, that source can no longer track you. Voila! At a more technical level, Privacy Badger keeps note of the "third party" domains that embed images, scripts and advertising in the pages you visit. If a third party server appears to be tracking you without permission, by using uniquely identifying cookies (and, as of version 1.0, local storage super cookies and canvas fingerprinting as well) to collect a record of the pages you visit across multiple sites, Privacy Badger will automatically disallow content from that third party tracker. In some cases a third-party domain provides some important aspect of a page's functionality, such as embedded maps, images, or stylesheets. In those cases Privacy Badger will allow connections to the third party but will screen out its tracking cookies and referrers. <p align="right">[<a href="#top">top</a>]</p>
de: <a id="how_does_it_work"></a>Wenn Du eine Webseite besuchst wird diese oft von Inhalten aus verschiedenen Quellen zusammengesetzt sein. (z.B. Eine Nachrichtenseite lädt die Artikel von der Nachrichtenagentur, Werbung von einer anderen Firma und die Kommentare unter den Artikeln von einer anderen Firma die diesen Service für die Nachrichtenagentur bereit stellt.) Privacy Badger merkt sich all diese Verbindungen. Wen Du durch das Web surfst und Dich eine der Quellen dich über verschiedene Webseiten tracked wird Privacy Badger aktiv, er sagt deinem Browser das er das er keine Daten mehr von dieser Quelle laden soll. Wenn keine Daten mehr von dieser Quelle geladen werden kann sie dich nicht mehr durch das Netz verfolgen. Voila! Eine technische Erklärung, Privacy Badger notiert sich die "dritt Anbieter" domains welche Bilder, Skripte und Werbung die in den besuchten Seiten eingefügt sind. Privacy Bager verbietet Inhalte von dritt Anbieter trackern, wenn es den Anschein hat das ein Server eines solchen dritt Anbieters dich ohne deine Zustimmung tracked und mithilfe von uniquely identifying cookies (und seit Version 1.0 auch mit lokal gespeicherten super cookies und canvas fingerprinting) versucht ein Profil von der von Dir besuchten Seiten zu erstellen. In manchen Fällen bieten dritt Anbieter domains auch einen Mehrwert, wie eingebundene Karten, Bilder oder Formatierungen. In diesen Fällen lässt Privacy Badger eine Verbindung zu den dritt Anbietern zu aber filtert die traking cookis und Referenzen. <p align="right">[<a href="#top">top</a>]</p>

# 863][field_questions][3][question
source: What is a third party tracker?
de: Was ist ein dritt Anbieter tracker?

# 863][field_questions][3][answer
source: <a id="trackers"></a>When you visit a webpage parts of the page may come from domains and servers other than the one you asked to visit. This is an essential feature of <a href="https://en.wikipedia.org/wiki/Hypertext">hypertext</a>, but it has also come to be a serious privacy problem. On the modern Web, embedded images and code often use cookies and other methods to track your browsing habits — often to display advertisements. The domains that do this are called "third party trackers", and you can read more about how they work <a href="https://www.eff.org/deeplinks/2009/09/online-trackers-and-social-networks">here</a>.
de: <a id="trackers"></a>Wenn Du eine Webseite besuchst kommen Teile der Webseite von anderen domains und Servern als der besuchten. Das ist ein essentieller Bestandteil des <a href="https://de.wikipedia.org/wiki/Hypertext">hypertext</a>, es hat sich aber auch zu einem ernsthaften Problem für die Privatsphäre entwickelt. Im modernen Internet werden eingefügte Bilder und Code oft mit cookies und anderen Methoden zum tracking versehen und oft um Werbung anzuzeigen. Die Domains die so etwas machen nennen sich dritt Anbieter tracker. Du kannst (auf Englisch) <a href="https://www.eff.org/deeplinks/2009/09/online-trackers-and-social-networks">hier</a> mehr Informationen finden

# 863][field_questions][4][question
source: What do the red, yellow and green sliders in the Privacy Badger menu mean?
de: Was bedeuten die grünen, gelben und roten Schaltflächen im Privacy Badger Menü?

# 863][field_questions][4][answer
source: <a id="what_do_the_colors_mean"></a>The colors mean the following: <ul><li>Green means there's a third party domain, but it hasn't yet been observed tracking you across multiple sites, so it might be unobjectionable. When you first install Privacy Badger every domain will be in this green state but as you browse, domains will quickly be classified as trackers.</li> <li>Yellow means that the third party domain appears to be trying to track you, but it is on Privacy Badger's cookie-blocking "yellowlist" of third party domains that, when analyzed, seemed to be necessary for Web functionality. In that case, Privacy Badger will load content from the domain but will try to screen out third party cookies and referrers from it.</li> <li>Red means that content from this third party tracker has been completely disallowed.</li> </ul> Privacy Badger analyzes each third party's behavior over time, and picks what it thinks is the right setting for each domain, but you can adjust the sliders if you wish.
de: <a id="what_do_the_colors_mean"></a>Die Farben haben folgende Bedeutung:<ul><li> Grün bedeutet es gibt eine dritt Anbieter Domain aber es wurde bis jetzt noch nicht beobachtet das sie dich über mehrere Seiten tracked, also ist hier nichts dagegen einzuwenden. Nachdem du Privacy Badger installiert hast wird jede Domain als grün Angezeigt während du im Internet surfst werden Domains schnell als tracker erkannt.<ul><li>Gelb bedeutet das die dritt Anbieter Domain den Anschein hat das sie dich tracken will aber sie ist auf Privacy Badger's "Gelben Liste" von dritt Anbieter Domains, die nach einer Analyse gezeigt haben das sie Notwendig für die Funktion der Webseiten sind. In diesem Fall werden Inhalte von der Domain geladen aber Privacy Badger entfernt dritt Anbieter cookies und Referenzen.<ul><li> Rot bedeutet das Inhalte von diesem dritt Anbieter tracker komplett verboten sind.<ul><li>Mit der Zeit analysiert Privacy Badger das Verhalten von jedem dritt Anbieter und entscheidet welche die richtige Einstellung für jede Domain ist. Du kannst diese Einstellungen aber auch jederzeit über die Schaltflächen ändern.

# 863][field_questions][5][question
source: Why does Privacy Badger block ads?
de: Warum blockiert Privacy Badger Werbung?

# 863][field_questions][5][answer
source: <a id="why_does_privacy_badger_block_ads"></a>Actually, nothing in the Privacy Badger code is specifically written to block ads. Rather, it focuses on disallowing any visible or invisible "third party" scripts or images that appear to be tracking you even though you specifically denied consent by sending a Do Not Track header. It just so happens that most (but not all) of these third party trackers are advertisements. When you see an ad, the ad sees you, and can track you. Privacy Badger is here to stop that.
de: <a id="why_does_privacy_badger_block_ads"></a>Eigentlich gibt es nichts im Code von Privacy Badger was speziell Werbung blockiert. Es beschränkt sich darauf jegliche sichtbaren oder unsichtbaren "dritt Anbieter" Skripte oder Bilder die den Anschein haben Dich zu tracken obwohl Du dem nicht zugestimmt hast indem ein <a href="https://de.wikipedia.org/wiki/Do_Not_Track_(Software)">Do Not Track Header</a> gesendet hast. Es ist nur so das die meisten (aber nicht alle) der dritt Anbieter tracker Werbung sind. Wenn Du also Werbung siehst kann dich auch die WErbung sehen und dich tracken. Privacy Badger ist hier um das zu stoppen.

# 863][field_questions][6][question
source: Why doesn't Privacy Badger block all ads?
de: Warum blockiert Privacy Badger nicht jede Werbung?

# 863][field_questions][6][answer
source: <a id="why_doesnt_privacy_badger_block_all_ads"></a>Because Privacy Badger is primarily a privacy tool, not an ad blocker. Our aim is not to block ads, but to prevent non-consensual invasions of people's privacy because we believe they are inherently objectionable. We also want to create incentives for advertising companies to do the right thing. Of course, if you really dislike ads, you can also install a traditional ad blocker.<a name="dnt-policy"></a>
de: <a id="why_doesnt_privacy_badger_block_all_ads"></a>Privacy Badger ist Hauptsächlich ein Programm zum Schutz der Privatsphäre und kein Werbe Blocker. Unser Ziel ist es nicht Werbung zu blockieren sondern den nicht gewollten Eingriff in die Privatsphäre zu verhindern, denn wir glauben dies ist immer unzulässig. Wir wollen außerdem einen Anreiz für Werbefirmen schaffen das richtige zu tun und Benutzer nicht zu tracken. Wenn Du wirklich keine Werbung sehen möchtest kannst du dir einen traditionellen Werbeblocker installieren.<a name="dnt-policy"></a>

# 863][field_questions][7][question
source: What about tracking by the sites I actively visit, like NYTimes.com or Facebook.com?
de: Was ist mit Seiten die ich direkt besuche, wie wikipedia.org oder Facebook.com?

# 863][field_questions][7][answer
source: <a id="what_about_first_party_tracking"></a>For the time being, Privacy Badger only protects you against tracking by third party sites. In the future we plan to add some privacy protections for "first party" sites that you actually visit. We are doing things in this order because the most scandalous, intrusive and objectionable form of online tracking is that conducted by companies you've <a href="http://mediamemo.allthingsd.com/files/2010/09/LUMA-display-ad-map.jpg">often never heard of</a> and have no relationship with. First and foremost, Privacy Badger is there to enforce Do Not Track against these domains by providing the technical means to restrict access to their tracking scripts and images. The right policy for whether nytimes.com, facebook.com or google.com can track you <i>when you visit that site</i> – and the technical task of preventing it – is more complicated because often (though not always) tracking is interwoven with the features the site offers, and sometimes (though not always) users may understand that the price of an excellent free tool like Google's search engine is measured in privacy, not money.
de: <a id="what_about_first_party_tracking"></a>Im Moment schützt Privacy Badger nur gegen tracking von dritt Anbietern Seiten. Wir planen in Zukunft einen Schutz für "erst Anbietern" Seiten die Du direkt besuchst einzubauen. Wir haben uns für diese Reihenfolge entschieden da die häufigste, aufdringlichste und verwerflichste Form von online tracking wird von Firmen durchgeführt von denen <a href="http://mediamemo.allthingsd.com/files/2010/09/LUMA-display-ad-map.jpg">man meistens noch nie gehört</a> und auch keine Verbindung hat. Zuerst ist Privacy Badger dafür da Do Not Track gegen diese Domains durchzusetzen, indem die tracking Skripte und Bilder unterbunden werden. Die richtige Taktik ob Facebook.com oder google.com dich, bei einem Besuch, tracken können ist komplizierter. Oft ist das tracking mit den Funktionen der Seite verbunden und in oft verstehen die Benutzer das der Preis eines kostenlosen Services wie Googles Suche in einer weitergaben von Daten finanziert wird und nicht mit einer Gebühr.

# 863][field_questions][8][question
source: Does Privacy Badger contain a "black list" of blocked sites?
de: Hat Privacy Badger eine schwarze Liste mit geblockten Seiten?

# 863][field_questions][8][answer
source: <a id="is_there_a_black_list"></a>No, unlike other blocking tools like AdBlock Plus, we have not made decisions about which sites to block, but rather about which behavior is objectionable. Domains will only be blocked or screened if the Privacy Badger code inside your browser actually observes the domain collecting unique identifiers after it was sent a Do Not Track message. Privacy Badger <i>does</i> contain a "<a href="https://github.com/EFForg/privacybadgerchrome/blob/master/doc/sample_cookieblocklist.txt">yellowlist</a>" of some sites that are known to provide essential third party resources; those sites show up as yellow and have their cookies blocked rather than being blocked entirely. This is a compromise with practicality, and in the long term we hope to phase out the yellowlist as these third parties begin to <a href="/dnt-policy">explicitly commit to respecting Do Not Track</a>. The criteria for including a domain on the yellowlist can be <a href="https://github.com/EFForg/privacybadgerchrome/blob/master/yellowlist-criteria.txt" target="_blank">found here</a>.
de: <a id="is_there_a_black_list"></a>Nein, anders als andere block tools, wie AdBlock Plus, entscheiden nicht wir welche Seiten geblockt werden sondern was für ein Verhalten der Seitenbetreiber nicht in Ordnung ist. Domains werden nur geblockt oder gefiltert wenn Privacy Badger feststellt das die Domain Individuelle Identifizierungsmerkmale sammelt nachdem sie eine "Do not Track" Nachricht erhalten hat. Privacy Badger <i>hat</i> eine "<a href="https://github.com/EFForg/privacybadgerchrome/blob/master/doc/sample_cookieblocklist.txt">Gelbe Liste</a>". Dies sind Seiten von denen wir wissen das sie einen notwendigen Service eines dritt Anbieters bereitstellen; diese Seiten erscheinen als gelb und es werden nur die cookies blockiert und nicht die gesamte Seite. Für uns ist dies ein Kompromiss und wir hoffen das in der Zukunft auf die Gelben Liste verzichten können wenn dritt Anbieter <a href="/dnt-policy">Do Not Track respektieren</a>. Die Voraussetzungen um auf die Gelbe Liste aufgenommen zu werden kann man <a href="https://github.com/EFForg/privacybadgerchrome/blob/master/yellowlist-criteria.txt" target="_blank">hier</a> finden.

# 863][field_questions][9][question
source: How was the cookie blocking yellowlist created?
de: Wie wurde die Gelbe Liste kreiert?

# 863][field_questions][9][answer
source: <a id="how_was_the_white_list_created"></a>The initial list of domains that should be cookie blocked rather than blocked entirely was derived from a <a href="https://jonathanmayer.org/papers_data/bau13.pdf">research project</a> on classifying third party domains as trackers and non-trackers. We will make occasional adjustments to it as necessary. If you find domains that are under- or over-blocked, please <a href="https://github.com/EFForg/privacybadgerchrome/issues">file a bug</a> on Github.
de: <a id="how_was_the_white_list_created"></a>Die ursprüngliche Domain Liste von Seiten, bei denen nur die Cookies und nicht die gesamte Seite blockiert wird, wurde von einem <a href="https://jonathanmayer.org/papers_data/bau13.pdf">forschungs Projekt</a> übernommen welches dritt Anbieter Domains als tracker und nicht-tracker einteilt. Wenn es nötig ist modifizieren wir diese Liste. Wenn Du Domains findest bei denen zu viel oder zu wenig blockiert wird <a href="https://github.com/EFForg/privacybadgerchrome/issues">teile uns bitte den Fehler auf Github mit</a>.

# 863][field_questions][11][question
source: Does Privacy Badger consider every cookie to be a tracking cookie?
de: Geht Privacy Badger bei jedem Cookie davon aus das es sich um einen tracking Cookie handelt?

# 863][field_questions][11][answer
source: <a id="is_every_cookie_a_tracking_cookie"></a>No. Privacy Badger analyzes the cookies from each site; unique cookies that contain tracking IDs are disallowed, while "low entropy" cookies that perform other functions are allowed. For instance a cookie like LANG=fr that encodes the user's language preference, or a cookie that preserves a very small amount of information about ads the user has been shown, would be allowed provided that individual or small groups of users' reading habits could not be collected with them. We have a <a href="https://github.com/EFForg/privacybadgerchrome/blob/master/src/heuristicblocking.js#l482">very rough</a> implementation of this; pull requests are welcome.
de: <a id="is_every_cookie_a_tracking_cookie"></a>Nein, Privacy Badger analysiert die Cookies von jeder Seite; Cookies die eine tracking ID beinhalten werden unterbunden, Cookies die "wenig" Daten übermitteln sind jedoch erlaubt. Zum Beispiel ein Cookie der durch LANG=de der Webseite mitteilt welche Sprache bevorzugt wird oder ein Cookie der nur wenige Informationen über die schon gezeigte Werbung, würden erlaubt werden solange das Surfverhalten der Benutzer nicht gesammelt werden können. Wir haben <a href="https://github.com/EFForg/privacybadgerchrome/blob/master/src/heuristicblocking.js#l482">noch sehr frühe</a> Anwendung. Hilfe bei der Entwicklung ist sehr Willkommen.

# 863][field_questions][12][question
source: Does Privacy Badger account for a cookie that was used to track me even if I deleted it?
de: Merkt sich Privacy Badger Cookies die mich tracken wollen auch wenn ich die Cookies lösche?

# 863][field_questions][12][answer
source: <a id="what_about_deleted_cookies"></a>Yes. Privacy Badger keeps track of cookies that could be used to track you and where they came from, even if you frequently clear your browser's cookies.
de: <a id="what_about_deleted_cookies"></a>Ja, Privacy Badger merkt sich die Cookies die dich traccken könnten und von welcher Seite sie kommen, auch wenn Du deinen Browserverlauf löscht.

# 863][field_questions][13][question
source: Will you be supporting any other browsers besides Chrome / Firefox?
de: Werden in Zukunft auch andere Browser als Chrome / Firefox unterstützt?

# 863][field_questions][13][answer
source: <a id="safari_and_ie"></a>In the near future we hope to release Privacy Badger for Opera, Safari, and Firefox Mobile. Unfortunately at the moment we cannot support Internet Explorer, since current version IE appears to be incompatible with how Privacy Badger works at a technical level. (With that said, if you would like to work on porting Privacy Badger to other platforms, please let us know!)
de: <a id="safari_and_ie"></a>Wir hoffen in der nahen Zukunft Privacy Badger für Safari und Firefox Mobile. Leider können wir im Moment den Internet Explorer nicht unterstützen da dieser Privacy Badger aus technischen Gründen nicht unterstützt. (Wenn Du an einer poertierung von Privacy Badger auf eine ander Platform arbeiten möchtest lasse uns das bitte wissen!)

# 863][field_questions][14][question
source: Can I download Privacy Badger outside of the Chrome Web Store?
de: Kann Ich Privacy Badger woanders als im Chrome Web Store herunterladen?

# 863][field_questions][14][answer
source: <a id="no_chrome_store"></a>You can! If you are using an alternative Chromium based browser such as Chromium ports Iron, Comodo Dragon, or Maxthon you can get the latest version of the addon directly from this link: <a href="https://www.eff.org/files/privacy_badger-chrome.crx">https://www.eff.org/files/privacy_badger-chrome.crx</a>
de: <a id="no_chrome_store"></a>Du kannst! Wenn Du einen alternativen Browser benutzt der auf Chromium basiert, wie z.B. Opera, Vivaldi, Chromium ports Iron oder Comodo Dragon, kannst Du die Aktuelle Version des Addons direkt über folgenden Link: <a href="https://www.eff.org/files/privacy_badger-chrome.crx">https://www.eff.org/files/privacy_badger-chrome.crx</a>

# 863][field_questions][15][question
source: I am an online advertising / tracking company. How do I stop Privacy Badger from blocking me?
de: Ich arbeite für eine Werbe- Trackingfirma. Wie kann ich erreichen das Privacy Badger meiner Firma nicht mehr blockiert?
