Repository: EFForg/www-l10n
Catalog: translations/*/JobID35_*.xlf
Languages: tr

# 638][body][0][summary
source: <h3> Which apps and tools actually keep your messages safe?</h3> <div class="section"> In the face of widespread Internet surveillance, we need a secure and practical means of talking to each other from our phones and computers. Many companies offer “secure messaging” products—but are these systems actually secure? We decided to find out, in the first phase of a new EFF Campaign for Secure &amp; Usable Crypto. This scorecard represents only the first phase of the campaign. In later phases, we are planning to offer closer examinations of the usability and security of the tools that score the highest here. As such, <span style="text-decoration: underline;"> the results in the scorecard below should not be read as endorsements of individual tools or guarantees of their security</span> ; they are merely indications that the projects are on the right track. For practical advice and tutorials on how to protect your online communication against surveillance, check out EFF's <a href="https://ssd.eff.org/"> Surveillance Self-Defense</a> guide. </div>
tr: <h3> Hangi uygulamalar ve araçlar mesajlarınızı gerçekten güvende tutuyor?</h3><div class="section"> Yaygın internet gözetimiyle karşılaştığımız bugünlerde, bilgisayarlarımız ve telefonlarımız aracılığıyla birbirimizle konuşabilmek için güvenli ve pratik yöntemlere ihtiyacımız var. Birçok firma "güvenli mesajlaşma" ürünleri sunuyor, ancak bu ürünler gerçekten güvenli mi? EFF'in Güvenli &amp; Kullanılabilir Kripto kampanyasının ilk adımı olarak bu soruya cevap bulmaya çalıştık. Bu skorkardı kampanyanın sadece ilk aşamasını temsil ediyor. Daha sonraki aşamalarda, bu skorkardından yüksek not almış araçların güvenliğini ve kullanılabilirliğini daha yakından incelemeyi planlıyoruz. Bu yüzden, <span style="text-decoration: underline;">aşağıda yer alan skorkardındaki sonuçlar tekil araçların onaylandığı ya da güvenliklerinin garantilendiği şeklinde algılanmamalıdır</span>; aşağıdaki liste sadece bu araçların doğru yolda olduklarının bir göstergesidir. Çevrimiçi haberleşmelerinizi nasıl koruyabileceğinizle alakalı pratik ipuçları ve öğreticiler için EFF'in hazırladığı <a href="https://ssd.eff.org/">Gözetim Meşru Müdafaa</a> rehberine göz atabilirsiniz.</div>

# 638][title_field][0][value
source: Secure Messaging Scorecard
tr: Güvenli Mesajlaşma Skorkardı

# 640][menu:item:1956:title
source: Creating HTTPS Everywhere Rulesets
tr: HTTPS Everywhere Kuralsetlerini Yaratmak

# 641][menu:item:7475:title
source: HTTPS Everywhere Atlas
tr: HTTPS Everywhere Atlası

# 642][menu:item:1955:title
source: How to Deploy HTTPS Correctly
tr: HTTPS Doğru Bir Şekilde Nasıl Deploy Edilir?

# 643][menu:item:1957:title
source: Report Bugs / Hack On The Code
tr: Bug Bildirimi / Kodu Hackleyin

# 644][menu:item:1954:title
source: FAQ
tr: SSS

# 645][singular
source: HTTPS Everywhere is a Firefox, Chrome, and Opera extension that encrypts your communications with many major websites, making your browsing more secure.
tr: HTTPS Everywhere, birçok büyük websitesiyle olan haberleşmelerinizi şifreleyerek tarayıcınızı daha güvenli yapan bir Firefox, Chrome ve Opera eklentisidir.

# 646][singular
source: Encrypt the web: Install HTTPS Everywhere today.
tr: Web'i şifreleyin: HTTPS Everywhere'i şimdi kurun.

# 647][singular
source: Install in Firefox
tr: Firefox'a Kur

# 648][singular
source: Install in Firefox for Android
tr: Android için Firefox'a Kur

# 649][singular
source: Install in Chrome
tr: Chrome'a Kur

# 650][singular
source: Install in Opera
tr: Opera'ya Kur

# 651][singular
source: Recent Releases
tr: Son Sürümler

# 652][singular
source: Stable releases for Firefox:
tr: Firefox için kararlı sürümler:

# 653][singular
source: Stable releases for Chrome, Chromium, and Opera 15+:
tr: Chrome, Chromium ve Opera 15+ için kararlı sürümler:

# 655][singular
source: Note: If you install the standalone .crx (i.e. not from the Chrome Web Store), and you are using Windows, Chrome will automatically disable the extension on each restart. You may be able to work around by using developer mode. See <a href="https://github.com/EFForg/https-everywhere/issues/819"> this issue</a> .
tr: Not: Bağımsız .crx dosyasını (Chrome Web Store'u kullanmadan) kurarsanız ve Windows kullanıyorsanız, Chrome tarayıcınızı yeniden başlattığınızda eklentiyi otomatik olarak devre dışı bırakır. Geliştirici modunu kullanarak buna geçici bir çözüm bulabilirsiniz. <a href="https://github.com/EFForg/https-everywhere/issues/819">Linkteki issue'ya</a> gözatın.

# 656][singular
source: Featured Tools
tr: Öne Çıkan Araçlar

# 657][singular
source: All Tools
tr: Tüm Araçlar

# 658][singular
source: Yes
tr: Evet

# 659][singular
source: No
tr: Hayır

# 660][singular
source: Encrypted in transit?
tr: Taşıma sırasında şifrelenmiş?

# 661][singular
source: Encrypted so the provider can’t read it?
tr: Sağlayıcının okuyamayacağı şekilde şifrelenmiş?

# 662][singular
source: Can you verify contacts’ identities?
tr: Kişilerin kimliği doğrulanabiliyor mu?

# 663][singular
source: Are past comms secure if your keys are stolen?
tr: Anahtarlar çalınmışsa geçmiş konuşmalar güvende mi?

# 664][singular
source: Is the code open to independent review?
tr: Kod bağımsız incelemeye açık mı?

# 665][singular
source: Is security design properly documented?
tr: Güvenlik tasarımı düzgünce belgelenmiş mi?

# 666][singular
source: Has there been any recent code audit?
tr: Kod yakın bir zamanda denetlenmiş mi?
