Repository: EFForg/www-l10n
Catalog: translations/*/JobID51_*.xlf
Languages: es

# 959][field_questions][0][question
source: What is Privacy Badger?
es: ¿Qué es Privacy Badger?

# 959][field_questions][0][answer
source: <a id="what_is_privacy_badger"></a>Privacy Badger is a browser add-on that stops advertisers and other third-party trackers from secretly tracking where you go and what pages you look at on the web. If an advertiser seems to be tracking you across multiple websites without your permission, Privacy Badger automatically blocks that advertiser from loading any more content in your browser. To the advertiser, it's like you suddenly disappeared.
es: <a id="what_is_privacy_badger"></a>Privacy Badger es una extensión para navegadores que bloquea anunciantes y otros rastreadores, evitando que sepan dónde navegas y qué páginas visitas en secreto. Si un anunciante parece rastrearte a través de varios sitios web sin tu permiso, Privacy Badger bloquea al anunciante automáticamente para que no cargue más contenido en tu navegador. Para el anunciante, es como si de repente hubieras desaparecido.

# 959][field_questions][1][question
source: How is Privacy Badger different to Disconnect, Adblock Plus, Ghostery, and other blocking extensions?
es: ¿En qué se diferencia Privacy Badger de otras extensiones de bloqueo, como Disconnect, Adblock Plus o Ghostery?

# 959][field_questions][1][answer
source: <a id="how_is_it_different"></a>Privacy Badger was born out of our desire to be able to recommend a single extension that would automatically analyze and block any tracker or ad that violated the principle of user consent; which could function well without any settings, knowledge, or configuration by the user; which is produced by an organization that is unambiguously working for its users rather than for advertisers; and which uses algorithmic methods to decide what is and isn't tracking. Although we like Disconnect, Adblock Plus, Ghostery and similar products (in fact Privacy Badger is based on the ABP code!), none of them are exactly what we were looking for. In our testing, all of them required some custom configuration to block non-consensual trackers. Several of these extensions have business models that we weren't entirely comfortable with. And EFF hopes that by developing rigorous algorithmic and policy methods for detecting and preventing non-consensual tracking, we'll produce a codebase that could in fact be adopted by those other extensions, or by mainstream browsers, to give users maximal control over who does and doesn't get to know what they do online.
es: <a id="how_is_it_different"></a>Privacy Badger nació de nuestro deseo por ser capaces de recomendar una única extensión que analizaría y bloquearía automáticamente cualquier rastreador o anuncio que violase el consentimiento del usuario; que pudiera funcionar bien sin configuración o conocimiento por parte del usuario; que es producido por una organización que trabaja inequívocamente para sus usuarios y no para anunciantes; y que usa métodos algorítmicos para decidir qué es y qué no es rastreo. Aunque nos gustan Disconnect, Adblock Plus, Ghostery y otros productos similares (¡De hecho Privacy Badger se basa en el código de ABP!), ninguno de ellos es exactamente lo que buscábamos. En la prueba, todos requerían algún tipo de configuración para bloquear rastreadores no consensuados. Muchas de estas extensiones tienen modelos de negocio con los que no estábamos del todo de acuerdo. Y la EFF espera que, desarrollando métodos algorítmicos y normas rigurosas para detectar y prevenir el rastreo no consentido, produciremos una base de código que podría de hecho ser adoptada por las otras extensiones, o por navegadores convencionales, para darle a los usuarios el máximo control sobre quién consigue información sobre lo que haces online.

# 959][field_questions][2][question
source: How does Privacy Badger work?
es: ¿Cómo funciona Privacy Badger?

# 959][field_questions][2][answer
source: <a id="how_does_it_work"></a>When you view a webpage, that page will often be made up of content from many different sources. (For example, a news webpage might load the actual article from the news company, ads from an ad company, and the comments section from a different company that's been contracted out to provide that service.) Privacy Badger keeps track of all of this. If as you browse the web, the same source seems to be tracking your browser across different websites, then Privacy Badger springs into action, telling your browser not to load any more content from that source. And when your browser stops loading content from a source, that source can no longer track you. Voila! At a more technical level, Privacy Badger keeps note of the "third party" domains that embed images, scripts and advertising in the pages you visit. If a third party server appears to be tracking you without permission, by using uniquely identifying cookies (and, as of version 1.0, local storage super cookies and canvas fingerprinting as well) to collect a record of the pages you visit across multiple sites, Privacy Badger will automatically disallow content from that third party tracker. In some cases a third-party domain provides some important aspect of a page's functionality, such as embedded maps, images, or stylesheets. In those cases Privacy Badger will allow connections to the third party but will screen out its tracking cookies and referrers. <p align="right">[<a href="#top">top</a>]</p>
es: <a id="how_does_it_work"></a>Cuando ves una página web, esa página estará hecha a partir de contenido de diferentes fuentes. (Por ejemplo, una página web de noticias cargará el artículo de la empresa de noticias, anuncios de la empresa de anuncios y una sección de comentarios de otra empresa distinta que ha sido contratada para ofrecer ese servicio.) Privacy Badger mantiene un seguimiento de todo esto. Si mientras navegas en la web, la misma fuente parece seguirte a través de diferentes sitios, Privacy Badger sale a la acción, diciéndole a tu navegador que no cargue más contenido de esa fuente. Y cuando tu navegador para de cargar contenido de una fuente, esa fuente ya no puede rastrearte. ¡Voila! A nivel más técnico, Privacy Badger anota los dominios de "terceros" que incrustan imágenes, scripts y anuncios en las páginas que visitas. Si un servidor de terceros parece rastrearte sin permiso, mediante el uso de cookies de identificación única (y, a partir de la versión 1.0, supercookies de almacenamiento local e identificación de huellas de canvas) para obtener un registro de las páginas que visitas a través de múltiples sitios, Privacy Badger deshabilitará automáticamente el contenido del rastreador de terceros. En algunos casos dominios de terceros ofrecen aspectos importantes para la funcionalidad de una página, como mapas incrustados, imágenes u hojas de estilo. En esos casos Privacy Badger habilitará las conexiones a la tercera parte, pero descartará sus cookies de rastreo y derivadas. <p align="right">[<a href="#top">arriba</a>]</p>

# 959][field_questions][3][question
source: What is a third party tracker?
es: ¿Qué es un rastreador de terceros?

# 959][field_questions][3][answer
source: <a id="trackers"></a>When you visit a webpage parts of the page may come from domains and servers other than the one you asked to visit. This is an essential feature of <a href="https://en.wikipedia.org/wiki/Hypertext">hypertext</a>, but it has also come to be a serious privacy problem. On the modern Web, embedded images and code often use cookies and other methods to track your browsing habits — often to display advertisements. The domains that do this are called "third party trackers", and you can read more about how they work <a href="https://www.eff.org/deeplinks/2009/09/online-trackers-and-social-networks">here</a>.
es: <a id="trackers"></a>Cuando visitas una página web, es posible que partes de la página vengan de dominios y otros servidores además del que querías visitar. Esta es una característica esencial del <a href="https://en.wikipedia.org/wiki/Hypertext">hipertexto</a>, pero también resulta ser un serio problema de privacidad. En la Web moderna, imágenes y código incrustado suelen utilizar cookies y otros métodos para rastrear tu hábitos de navegación -- a menudo para mostrar anuncios. Los dominios que hacen esto se llaman "rastreadores de terceros", y puedes leer más acerca de su funcionamiento <a href="https://www.eff.org/deeplinks/2009/09/online-trackers-and-social-networks">aquí</a>.

# 959][field_questions][4][question
source: What do the red, yellow and green sliders in the Privacy Badger menu mean?
es: ¿Qué significan las barras deslizantes rojas, amarillas y verdes en el menú de Privacy Badger?

# 959][field_questions][4][answer
source: <a id="what_do_the_colors_mean"></a>The colors mean the following: <ul><li>Green means there's a third party domain, but it hasn't yet been observed tracking you across multiple sites, so it might be unobjectionable. When you first install Privacy Badger every domain will be in this green state but as you browse, domains will quickly be classified as trackers.</li> <li>Yellow means that the third party domain appears to be trying to track you, but it is on Privacy Badger's cookie-blocking "yellowlist" of third party domains that, when analyzed, seemed to be necessary for Web functionality. In that case, Privacy Badger will load content from the domain but will try to screen out third party cookies and referrers from it.</li> <li>Red means that content from this third party tracker has been completely disallowed.</li> </ul> Privacy Badger analyzes each third party's behavior over time, and picks what it thinks is the right setting for each domain, but you can adjust the sliders if you wish.
es: <a id="what_do_the_colors_mean"></a>Los colores significan lo siguiente: <ul><li>Verde quiere decir que hay un dominio de terceros, pero no se ha visto rastreándote a través de varios sitios, así que puede ser aceptable. La primera vez que instalas Privacy Badger cada dominio se encontrará en este estado, pero a medida que vas navegando, los dominios se clasificarán rápidamente como rastreadores.</li> <li>Amarillo significa que el dominio parece estar tratando de rastrearte, pero está la "lista amarilla" de Privacy Badger con dominios que, al ser analizados, resultan ser necesarios para el funcionamiento de la Web. En este caso, Privacy Badger cargará contenido del dominio, pero descartará cookies de terceros y derivados del mismo.</li> <li>Rojo quiere decir que el contenido de este rastreador de terceros se ha bloqueado completamente.</li> </ul>Privacy Badger analiza el comportamiento de cada tercera parte todo el tiempo, y elige la que cree que es la configuración adecuada para cada dominio, pero puedes ajustar las barras manualmente si quieres.

# 959][field_questions][5][question
source: Why does Privacy Badger block ads?
es: ¿Por qué Privacy Badger bloquea anuncios?

# 959][field_questions][5][answer
source: <a id="why_does_privacy_badger_block_ads"></a>Actually, nothing in the Privacy Badger code is specifically written to block ads. Rather, it focuses on disallowing any visible or invisible "third party" scripts or images that appear to be tracking you even though you specifically denied consent by sending a Do Not Track header. It just so happens that most (but not all) of these third party trackers are advertisements. When you see an ad, the ad sees you, and can track you. Privacy Badger is here to stop that.
es: <a id="why_does_privacy_badger_block_ads"></a>En realidad, no hay nada en el código de Privacy Badger escrito explícitamente para bloquear anuncios. Más bien, se centra en deshabilitar cualquier script o imágenes visibles o invisibles de "terceros" que parezcan rastrearte incluso después de haberlo denegado específicamente usando la cabecera Do Not Track. Simplemente se da el caso de que la mayoría (pero no todos) de estos rastreadores de terceros son anuncios. Cuando ves un anuncio, el anuncio te ve y puede rastrearte. Privacy Badger está aquí para evitar eso.

# 959][field_questions][6][question
source: Why doesn't Privacy Badger block all ads?
es: ¿Por qué Privacy Badger no bloquea todos los anuncios?

# 959][field_questions][6][answer
source: <a id="why_doesnt_privacy_badger_block_all_ads"></a>Because Privacy Badger is primarily a privacy tool, not an ad blocker. Our aim is not to block ads, but to prevent non-consensual invasions of people's privacy because we believe they are inherently objectionable. We also want to create incentives for advertising companies to do the right thing. Of course, if you really dislike ads, you can also install a traditional ad blocker.<a name="dnt-policy"></a>
es: <a id="why_doesnt_privacy_badger_block_all_ads"></a>Porque Privacy Badger es principalmente una herramienta de privacidad, no un bloqueador de anuncios. Nuestro propósito no es bloquear anuncios, si no prevenir invasiones a la privacidad de las personas sin consentimiento, porque consideramos que son inaceptables. También queremos motivar a los anunciantes para que hagan las cosas bien. Por supuesto, si no te gustan nada los anuncios, también puedes instalar un bloqueador de anuncios tradicional.<a name="dnt-policy"></a>

# 959][field_questions][7][question
source: What about tracking by the sites I actively visit, like NYTimes.com or Facebook.com?
es: ¿Qué ocurre con los sitios que visito normalmente, como NYTimes.com o Facebook.com?

# 959][field_questions][7][answer
source: <a id="what_about_first_party_tracking"></a>For the time being, Privacy Badger only protects you against tracking by third party sites. In the future we plan to add some privacy protections for "first party" sites that you actually visit. We are doing things in this order because the most scandalous, intrusive and objectionable form of online tracking is that conducted by companies you've <a href="http://mediamemo.allthingsd.com/files/2010/09/LUMA-display-ad-map.jpg">often never heard of</a> and have no relationship with. First and foremost, Privacy Badger is there to enforce Do Not Track against these domains by providing the technical means to restrict access to their tracking scripts and images. The right policy for whether nytimes.com, facebook.com or google.com can track you <i>when you visit that site</i> – and the technical task of preventing it – is more complicated because often (though not always) tracking is interwoven with the features the site offers, and sometimes (though not always) users may understand that the price of an excellent free tool like Google's search engine is measured in privacy, not money.
es: <a id="what_about_first_party_tracking"></a>Por el momento, Privacy Badger solo te protege contra el rastreo de terceros. En el futuro tenemos planeado añadir protecciones de privacidad para sitios "primarios" que visitas a conciencia. Estamos haciendo las cosas en este orden porque las formas más escandalosas, intrusivas y ofensivas de rastreo online son llevadas a cabo por empresas de las que, <a href="http://mediamemo.allthingsd.com/files/2010/09/LUMA-display-ad-map.jpg">a menudo, no has oído hablar</a> o con las que no tienes relación. Primero y ante todo, Privacy Badger está para hacer cumplir Do Not Track contra esos dominios mediante los medios técnicos necesarios para restringir sus imágenes y scripts de rastreo. La norma adecuada por si nytimes.com, facebook.com o google.com pueden rastrearte <i>cuando visitas ese sitio</i> -- y la tarea técnica de prevenirlo -- es más complicada por que a menudo (aunque no siempre) el rastreo está entrelazado con las características del sitio, y a veces (aunque no siempre) los usuarios comprenderán que el precio de una herramienta gratuita y excelente como el motor de búsqueda de Google se mide en privacidad, no en dinero.

# 959][field_questions][8][question
source: Does Privacy Badger contain a "black list" of blocked sites?
es: ¿Privacy Badger contiene una "lista negra" de sitios bloqueados?

# 959][field_questions][8][answer
source: <a id="is_there_a_black_list"></a>No, unlike other blocking tools like AdBlock Plus, we have not made decisions about which sites to block, but rather about which behavior is objectionable. Domains will only be blocked or screened if the Privacy Badger code inside your browser actually observes the domain collecting unique identifiers after it was sent a Do Not Track message. Privacy Badger <i>does</i> contain a "<a href="https://github.com/EFForg/privacybadgerchrome/blob/master/doc/sample_cookieblocklist.txt">yellowlist</a>" of some sites that are known to provide essential third party resources; those sites show up as yellow and have their cookies blocked rather than being blocked entirely. This is a compromise with practicality, and in the long term we hope to phase out the yellowlist as these third parties begin to <a href="/dnt-policy">explicitly commit to respecting Do Not Track</a>. The criteria for including a domain on the yellowlist can be <a href="https://github.com/EFForg/privacybadgerchrome/blob/master/yellowlist-criteria.txt" target="_blank">found here</a>.
es: <a id="is_there_a_black_list"></a>No, a diferencia de otras herramientas de bloqueo como AdBlock Plus, no hemos tomado decisiones sobre qué sitios bloquear, si no sobre qué comportamiento es inaceptable. Los dominios solo serán bloqueados o descartados si el código de Privacy Badger dentro de tu navegador observa que el dominio está recolectando identificadores únicos después de haber enviado un mensaje Do Not Track. Privacy Badger <i>contiene</i> una "<a href="https://github.com/EFForg/privacybadgerchrome/blob/master/doc/sample_cookieblocklist.txt">lista amarilla</a>" de algunos sitios que se sabe, proveen recursos de terceros esenciales; estos sitios se muestran en amarillo y tienes sus cookies bloqueadas, en lugar de ser bloqueados al completo. Este es el compromiso con la funcionalidad, y a largo plazo, esperamos eliminar gradualmente la lista amarilla a medida que estos terceros comiencen a <a href="/dnt-policy">respetar explícitamente Do Not Track</a>. Los criterios para incluir un dominio en la lista amarilla se pueden encontrar <a href="https://github.com/EFForg/privacybadgerchrome/blob/master/yellowlist-criteria.txt" target="_blank">aquí</a>.

# 959][field_questions][9][question
source: How was the cookie blocking yellowlist created?
es: ¿Cómo se creó la lista amarilla de bloqueo de cookies?

# 959][field_questions][9][answer
source: <a id="how_was_the_white_list_created"></a>The initial list of domains that should be cookie blocked rather than blocked entirely was derived from a <a href="https://jonathanmayer.org/papers_data/bau13.pdf">research project</a> on classifying third party domains as trackers and non-trackers. We will make occasional adjustments to it as necessary. If you find domains that are under- or over-blocked, please <a href="https://github.com/EFForg/privacybadgerchrome/issues">file a bug</a> on Github.
es: <a id="how_was_the_white_list_created"></a>La lista inicial de dominios de los cuales se deberían bloquear cookies, en lugar de ser bloqueados al completo deriva de un <a href="https://jonathanmayer.org/papers_data/bau13.pdf">proyecto de investigación</a> de clasificación de dominios de terceros como rastreadores y no rastreadores. Haremos ajustes ocasionalmente si es necesario. Si crees que tus dominios están sub o sobrebloqueados, por favor <a href="https://github.com/EFForg/privacybadgerchrome/issues">presenta un bug</a> en GitHub.

# 959][field_questions][10][question
source: Does Privacy Badger prevent fingerprinting?
es: ¿Privacy Badger previene la identificación por medio de huellas digitales?

# 959][field_questions][10][answer
source: <a id="does_it_prevent_fingerprinting"></a>Browser fingerprinting is an extremely subtle and problematic method of tracking, which we <a href="https://panopticlick.eff.org">documented with the Panopticlick project</a>. Privacy Badger 1.0 can detect <a href="http://janhkrueger.de/gitpup/RSSArtikel/raw/bd53c81bd5d1ee434d76a64ece26de1aac3a218d/w2sp12-final4.pdf" target="_blank">canvas</a> <a href="http://filelifter.de/assets/plugindata/poola/thewebneverforgets.pdf" target="_blank">based</a> <a href="https://www.propublica.org/article/meet-the-online-tracking-device-that-is-virtually-impossible-to-block" target="_blank">fingerprinting</a>, and will block third party domains that use it. Detection of other forms of fingerprinting and protections against first-party fingerprinting are ongoing projects. Of course, once a domain is blocked by Privacy Badger, it will no longer be able to fingerprint you as a third-party.
es: <a id="does_it_prevent_fingerprinting"></a>El seguimiento por huellas digitales del navegador es un método extremadamente sutil y problemático, que <a href="https://panopticlick.eff.org">hemos documentado con el proyecto Panopticlick</a>. Privacy Badger 1.0 puede detectar <a href="http://janhkrueger.de/gitpup/RSSArtikel/raw/bd53c81bd5d1ee434d76a64ece26de1aac3a218d/w2sp12-final4.pdf" target="_blank">seguimiento</a> <a href="http://filelifter.de/assets/plugindata/poola/thewebneverforgets.pdf" target="_blank">basado en</a> <a href="https://www.propublica.org/article/meet-the-online-tracking-device-that-is-virtually-impossible-to-block" target="_blank">lienzos</a>, y bloqueará dominios de terceros que lo utilizan. La detección de otras formas de seguimiento y las protecciones contra seguimiento de primeras partes son proyectos en desarrollo. Por supuesto, una vez un dominio es bloqueado por Privacy Badger, ya no será capaz de seguirte como tercero.

# 959][field_questions][11][question
source: Does Privacy Badger consider every cookie to be a tracking cookie?
es: ¿Privacy Badger considera que cada cookie es una cookie de rastreo?

# 959][field_questions][11][answer
source: <a id="is_every_cookie_a_tracking_cookie"></a>No. Privacy Badger analyzes the cookies from each site; unique cookies that contain tracking IDs are disallowed, while "low entropy" cookies that perform other functions are allowed. For instance a cookie like LANG=fr that encodes the user's language preference, or a cookie that preserves a very small amount of information about ads the user has been shown, would be allowed provided that individual or small groups of users' reading habits could not be collected with them. We have a <a href="https://github.com/EFForg/privacybadgerchrome/blob/master/src/heuristicblocking.js#l482">very rough</a> implementation of this; pull requests are welcome.
es: <a id="is_every_cookie_a_tracking_cookie"></a>No. Privacy Badger analiza las cookies de cada sitio; las cookies únicas que contienen identificadores de rastreo se bloquean, mientras que las cookies de "baja entropía" que realizan otras funciones, se permiten. Por ejemplo, una cookie como LANG=fr que codifica la preferencia lingüística del usuario, o una cookie que mantiene una cantidad muy pequeña de información sobre anuncios que el usuario ha visto, se dejarían pasar, teniendo en cuenta que los hábitos de lectura del individuo o el pequeño grupo de usuarios no se acumule. Tenemos una implementación <a href="https://github.com/EFForg/privacybadgerchrome/blob/master/src/heuristicblocking.js#l482">muy irregular</a> de esto; Se aceptan Pull Requests.

# 959][field_questions][12][question
source: Does Privacy Badger account for a cookie that was used to track me even if I deleted it?
es: ¿Privacy Badger tiene en cuenta una cookie que se usó para rastrearme incluso si la borré?
