Repository: EFForg/www-l10n
Catalog: translations/*/JobID51_*.xlf
Languages: es

# 959][field_questions][12][answer
source: <a id="what_about_deleted_cookies"></a>Yes. Privacy Badger keeps track of cookies that could be used to track you and where they came from, even if you frequently clear your browser's cookies.
es: <a id="what_about_deleted_cookies"></a>Sí. Privacy Badger monitoriza cookies que podrían usarse para rastrearte y de dónde vienen, incluso si limpias tu navegador habitualmente.

# 959][field_questions][13][question
source: Will you be supporting any other browsers besides Chrome / Firefox?
es: ¿Soportaréis otros navegadores además de Chrome / Firefox?

# 959][field_questions][13][answer
source: <a id="safari_and_ie"></a>In the near future we hope to release Privacy Badger for Opera, Safari, and Firefox Mobile. Unfortunately at the moment we cannot support Internet Explorer, since current version IE appears to be incompatible with how Privacy Badger works at a technical level. (With that said, if you would like to work on porting Privacy Badger to other platforms, please let us know!)
es: <a id="safari_and_ie"></a>En un futuro cercano, esperamos poder lanzar Privacy Badger para Opera, Safari y Firefox Mobile. Desafortunadamente, por el momento no tenemos soporte para Internet Explorer, ya que la versión actual de IE parece ser incompatible a nivel técnico con Privacy Badger. (Dicho esto, si te gustaría trabajar para portar Privacy Badger a otras plataformas, ¡contacta con nosotros!)

# 959][field_questions][14][question
source: Can I download Privacy Badger outside of the Chrome Web Store?
es: ¿Puedo descargar Privacy Badger fuera de la Chrome Web Store?

# 959][field_questions][14][answer
source: <a id="no_chrome_store"></a>You can! If you are using an alternative Chromium based browser such as Chromium ports Iron, Comodo Dragon, or Maxthon you can get the latest version of the addon directly from this link: <a href="https://www.eff.org/files/privacy_badger-chrome.crx">https://www.eff.org/files/privacy_badger-chrome.crx</a>
es: <a id="no_chrome_store"></a>¡Sí puedes! Si estás usando una versión alternativa basada en el navegador Chromium, como los ports de Iron, Comodo o Maxthon, puedes obtener la última versión de la extensión directamente desde este enlace: <a href="https://www.eff.org/files/privacy_badger-chrome.crx">https://www.eff.org/files/privacy_badger-chrome.crx</a>

# 959][field_questions][15][question
source: I am an online advertising / tracking company. How do I stop Privacy Badger from blocking me?
es: Soy una empresa de anuncios / rastreo. ¿Cómo puedo evitar que Privacy Badger me bloquee?

# 959][field_questions][15][answer
source: <a id="how_to_comply_with_dnt"></a>One way is to stop tracking third party users who have turned on the Do Not Track header (i.e., stop collecting cookies, supercookies or fingerprints from them). That will work for new Privacy Badger installs. If copies of Privacy Badger have already blocked your domain, you can unblock yourself by promising to respect the Do Not Track header in a way that conforms with the user's privacy policy. You can do that by posting a specific compliant <a href="https://www.eff.org/dnt-policy" target="_blank">DNT policy</a> to the URL <tt>http<b>s</b>://example.com/.well-known/dnt-policy.txt</tt>, where "example.com" is all of your DNT-compliant domains. Note that the domain <i>must</i> support HTTPS, to protect against tampering by network attackers. The path contains ".well-known" per <a href="https://tools.ietf.org/html/rfc5785">RFC 5785</a>. Privacy Badger currently checks for this specific <i>verbatim</i> policy document, though in the future Privacy Badger may allow content from sites that post different versions of a <a href="/dnt-policy">compliant DNT Policy</a>, and that there may be ways for users to specify their own acceptable DNT policies if they wish to.
es: <a id="how_to_comply_with_dnt"></a>Una de las opciones es parar de rastrear a terceros que han habilitado la cabecera Do Not Track (es decir, para de recoger cookies, supercookies o huellas digitales de ellos). Eso funcionará para las nuevas instalaciones de Privacy Badger. Si hay copias de Privacy Badger que ya han bloqueado tu dominio, puedes desbloquearte prometiendo respetar la cabecera Do Not Track de forma que cumpla las normas de privacidad del usuario. Puedes hacerlo presentando una <a href="https://www.eff.org/dnt-policy" target="_blank">norma conforme a DNT</a> específica a la URL <tt>http<b>s</b>://ejemplo.com/.conocida/norma-dnt.txt</tt>, donde "ejemplo.com" son todos tus dominios obedientes a DNT. Ten en cuenta que, el dominio <i>debe</i> soportar HTTPS, para protegerse contra la alteración por parte de atacantes. El localizador contiene ".conocidos" para la <a href="https://tools.ietf.org/html/rfc5785">RFC 5785</a>. Privacy Badger actualmente comprueba este documento de normativas <i>palabra por palabra</i>, aunque en el futuro Privacy Badger podría permitir contenido de otros sitios con diferentes versiones de una <a href="/dnt-policy">norma conforme a DNT</a>, y que haya opciones para que el usuario configure sus propias normativas DNT si lo prefieren.

# 959][field_questions][16][question
source: What is the Privacy Badger license? Where is the Privacy Badger source code?
es: ¿Cuál es la licencia de Privacy Badger? ¿Dónde está el código fuente de Privacy Badger?

# 959][field_questions][16][answer
source: <a id="license"></a>Privacy Badger is GPLv3 code, the Chrome version is based on a modified version of the AdBlock Plus engine. You can find the Privacy Badger source trees <a href="https://github.com/EFForg/">on Github</a>. There is also a <a href="https://lists.eff.org/mailman/listinfo/privacybadger">development mailing list</a>. Privacy Badger is governed by EFF's <a href="/code/privacy">Privacy Policy for Software</a>. <a name="comparison"></a>
es: <a id="license"></a>Privacy Badger es código GPLv3, la versiónde Chrome está basada en una modificación del motor de AdBlock Plus. Puedes encontrar los árboles de código fuente de Privacy Badger <a href="https://github.com/EFForg/">en Github</a>. También están <a href="https://lists.eff.org/mailman/listinfo/privacybadger">las listas de correo de desarrollo</a>. Privacy Badger está gobernado por la <a href="/code/privacy">Norma de Privacidad para Software </a>de la EFF. <a name="comparison"></a>

# 959][field_questions][17][question
source: I found a bug! What do I do now?
es: ¡He encontrado un bug! ¿Ahora qué hago?

# 959][field_questions][17][answer
source: <a id="i_found_a_bug"></a>First, please make sure the bug hasn't already been reported by checking the current bug list <a href="https://github.com/EFForg/privacybadgerfirefox/issues">for Firefox</a> or <a href="https://github.com/EFForg/privacybadgerchrome/issues">for Chrome</a>. If the bug hasn't yet been reported you can report the bug <a href="https://github.com/EFForg/privacybadgerfirefox/issues/new">here for Privacy Badger for Firefox</a> or <a href="https://github.com/EFForg/privacybadgerchrome/issues/new">here for Privacy Badger for Chrome</a>. If you don't have a GitHub account, then you can login using the anonymous one: "cypherpunk"/"cypherpunk", but please understand that doing so will limit our ability to communicate with you about the bug and make it harder for us to fix it quickly.
es: <a id="i_found_a_bug"></a>Primero, por favor, asegúrate de que el bug no se ha reportado aún comprobando la lista actual de bugs <a href="https://github.com/EFForg/privacybadgerfirefox/issues">para Firefox</a> o <a href="https://github.com/EFForg/privacybadgerchrome/issues">para Chrome</a>. Si no se ha informado del bug, puedes presentarlo <a href="https://github.com/EFForg/privacybadgerfirefox/issues/new">aquí para Privacy Badger en Firefox</a> o <a href="https://github.com/EFForg/privacybadgerchrome/issues/new">aquí para Privacy Badger en Chrome</a>. Si no tienes una cuenta de GitHub, puedes acceder a través de la cuenta anónima: "cypherpunk"/"cypherpunk", pero, por favor, ten en cuenta que si lo haces, limitarás nuestra capacidad para comunicarnos contigo acerca del bug y será más complicado arreglarlo rápidamente.

# 959][field_questions][18][question
source: How can I support Privacy Badger?
es: ¿Cómo puedo apoyar a Privacy Badger?

# 959][field_questions][18][answer
source: <a id="support"></a>Thanks for asking! Individual donations make up about half of EFF's support, which gives us the freedom to work on user-focused projects. If you want to support the development of Privacy Badger and other projects like it, helping build a more secure Internet ecosystem, you can <a href="https://supporters.eff.org/donate/support-privacy-badger">throw us a few dollars here</a>. Thank you. If you want to help with the code we appreciate that as well. Here are the lists of good volunteer tasks <a href="https://github.com/EFForg/privacybadgerfirefox/issues?q=is%3Aopen+is%3Aissue+label%3A%22Good+Volunteer+Task%22" target="_blank">[firefox]</a> <a href="https://github.com/EFForg/privacybadgerchrome/issues?q=is%3Aopen+is%3Aissue+label%3A%22Good+Volunteer+Task%22" target="_blank">[chrome]</a>.
es: <a id="support"></a>¡Gracias por preguntar! Las donaciones individuales representan cerca de la mitad de la ayuda que la EFF recibe, lo que nos da más libertad para trabajar en proyectos centrados en el usuario. Si quieres ayudar al desarrollo de Privacy Badger y otros proyectos similares, ayudando a contruir un ecosistema más seguro en Internet, puedes <a href="https://supporters.eff.org/donate/support-privacy-badger">dejarnos algunos dólares por aquí</a>. Gracias. Si quieres ayudar con el código, te lo agradecemos igualmente. Aquí está la lista de tareas para voluntarios <a href="https://github.com/EFForg/privacybadgerfirefox/issues?q=is%3Aopen+is%3Aissue+label%3A%22Good+Volunteer+Task%22" target="_blank">[firefox]</a> <a href="https://github.com/EFForg/privacybadgerchrome/issues?q=is%3Aopen+is%3Aissue+label%3A%22Good+Volunteer+Task%22" target="_blank">[chrome]</a>.

# 959][field_questions][19][question
source: How does Privacy Badger handle social media widgets?
es: ¿Cómo maneja Privacy Badger los artilugios de social media?

# 959][field_questions][19][answer
source: <a id="social"></a>Social media widgets (such as the Facebook Like button, Twitter Tweet button, or Google +1 button) often track your reading habits. Even if you don't click them, the social media companies often see exactly which pages you're seeing the widget on. Privacy Badger includes a feature imported from the <a href="http://sharemenot.cs.washington.edu/">ShareMeNot</a> project which is able to replace the widgets with a stand-in version, so that you can still see and click them. You will not be tracked by these replacements unless you explicitly choose to click them. Privacy Badger currently knows how to replace the following widgets if they are observed tracking you: AddThis, Facebook, Google, LinkedIn, Pinterest, Stumbleupon, and Twitter. (The source code for these replacements is <a href="https://github.com/EFForg/privacybadgerchrome/blob/master/src/socialwidgets.json">here</a>; pull requests are welcome) Note that Privacy Badger will not replace social media widgets unless it has blocked the associated tracker. If you're seeing real social media widgets, it generally means that Privacy Badger hasn't detected tracking from that variant of the widget, or that the site you're looking at has implemented its own version of the widget. To avoid confusion, the replacement widgets are marked with the Privacy Badger badge next to the button. To interact with a replacement widget, simply click on it. Depending on the widget, Privacy Badger will either send you directly to the appropriate sharing page (for example, to post a tweet) or it will enable and load the real social widget (for example, the Facebook Like button, with personalized information about how many of your friends have "liked" the page). In the second case, you will still need to interact with the real widget to "like" or share the page. <a id="connection-failure"></a>
es: <a id="social"></a>Los artilugios de social media (como el botón de Facebook, el botón de tweets de Twitter, o el botón +1 de Google) suelen rastrear tus hábitos de lectura. Incluso si no los clickeas, las empresas de social media a menudo ven en qué páginas has visto el artilugio. Privacy Badger incluye una aplicación importada del proyecto <a href="http://sharemenot.cs.washington.edu/">ShareMeNot</a> que es capaz de sustituir los artilugios con una versión suplente, para que puedas seguir clickeándolos. No vas a ser rastreado por estos sustitutos, a no ser que clickees en ellos explícitamente. Privacy Badger actualmente sabe cómo sustituir los siguientes artilugios, en caso de que te estén rastreando: AddThis, Facebook, Google, LinkedIn, Pinterest, Stumbleupon, y Twitter. (El código fuente de estos sustitutos está <a href="https://github.com/EFForg/privacybadgerchrome/blob/master/src/socialwidgets.json">aquí</a>; Pull Requests son bienvenidas) Ten en cuenta que Privacy Badger no va a reemplazar artilugios de social media, a no ser que se haya bloqueado el rastreador asociado. Si ves artilugios de social media reales, significa que Privacy Badger no ha detectado rastreo por parte del artilugio, o que el sitio que están visitando está usando su propia versión del artilugio. Para evitar confusión, los sustitutos se marcan con el emblema de Privacy Badger junto al artilugio. Para interactuar con uno de los sustitutos, simplemente haz click en él. Dependiendo del artilugio, Privacy Badger te llevará directamente a la página asociada a la acción del botón (por ejemplo, para publicar un tweet), o te dejará cargar el artilugio real (por ejemplo, el botón Like de Facebook, con información personalizada sobre a cuántos de tus amigos les ha "gustado" la página). En el segundo caso, todavía será necesario que interactues con el artilugio real para marcar como "me gusta" o compartir la página. <a id="connection-failure"></a>

# 959][field_questions][20][question
source: I'm having a problem installing the browser extension.
es: Tengo problemas para instalar la extensión para navegador.

# 959][field_questions][20][answer
source: Some people report that installing Privacy Badger gives them the error: "The addon could not be downloaded because of a connection failure on www.eff.org." This may be caused by Avast antivirus, which blocks installation of browser extensions. You may be able to work around by right-clicking to download the .xpi file, then dragging it into Firefox to install. If that fails, you may temporarily disable Avast antivirus before installing the extension.
es: Algunas personas informan de que, al instalar Privacy Badger, obtienen el error: "La extensión no se pudo descargar a causa de un fallo al conectar con www.eff.org." Esto puede ser a causa del antivirus Avast, que bloquea la instalación de extensiones en el navegador. Puedes evitarlo haciendo click derecho para descargar el archivo .xpi, para después arrastrarlo hasta Firefox para instalar. Si sigue fallando, podrías deshabilitar la extensión de Avast temporalmente antes de instalar la extensión.

# 959][field_questions][21][question
source: Is Privacy Badger compatible with other extensions, including other adblockers?
es: ¿Privacy Badger es compatible con otras extensiones, incluyendo otros bloqueadores de anuncios?

# 959][field_questions][21][answer
source: Privacy Badger is compatible with most extensions. Whether it makes sense to run it with another adblocker varies. If you have customized your adblocker settings to block trackers as well, Privacy Badger may be partially redundant (though it may offer advantages like cookie blocking that other tracker blockers do not). However if you run extensions like Adlbock Plus or Ghostery in their default configurations, Privacy Badger can significantly increase your privacy online. (Adblock does not block invisible trackers by default, Ghostery does not block anything by default.) The only extensions known to be incompatible with Privacy Badger is the Avast anitvirus extension, which blocks the installation of Privacy Badger and other extensions. Last updated July 22nd, 2015
es: Privacy Badger es compatible con la mayoría de las extensiones. Que tenga sentido usarlo con otros bloqueadores puede variar. Si has personalizado las opciones de tu bloqueador de anuncios para bloquear todos los rastreadores, Privacy Badger puede ser parcialmente redundante (aunque, puede ofrecer ventajas como el bloqueo de cookies que otros no ofrecen). De todas formas, si usas extensiones como AdBlock Plus o Ghostery con la configuración por defecto, Privacy Badger puede incrementar tu privacidad online de forma significativa. (AdBlock no bloquea rastreadores invisibles por defecto, Ghostery no bloquea nada por defecto.) La única extensión que se sabe es incompatible con Privacy Badger, es la extensión del antivirus Avast, que bloquea la instalación de Privacy Badger y otras extensiones. Actualizado por última vez el 22 de Julio de 2015

# 960][field_text_field][0][value
source: A Project of the <a href="/">Electronic Frontier Foundation</a>
es: Un proyecto de la <a href="/">Electronic Frontier Foundation</a>

# 961][singular
source: Privacy Badger blocks spying ads and invisible trackers.
es: Privacy Badger bloquea anuncios espía y rastreadores invisibles.

# 963][singular
source: Install Privacy Badger
es: Installar Privacy Badger

# 965][singular
source: and Enable Do Not Track
es: y Habilita Do Not Track

# 966][singular
source: Click here for !browser version
es: ¡Haz click aquí para !la versión del navegador

# 969][singular
source: Download for Firefox
es: Descargar para Firefox

# 970][singular
source: Download for Chrome
es: Descargar para Chrome
