Repository: EFForg/www-l10n
Catalog: translations/*/JobID35_*.xlf
Languages: tr

# 637][body][0][value
source: <p class="eff-light-blue eff-grey"> By <a href="http://noncombatant.org"> Chris Palmer</a> and <a href="/about/staff/yan-zhu"> Yan Zhu</a> </p> <p> <em> Originally published on 15 Nov 2010. Revised on 12 Dec 2013.</em> </p> <p> Internet technologists have always known that HTTP is insecure, causing many risks to users. Because HTTP traffic is unencrypted, any data sent over HTTP can be read and modified by anyone who has access to the network. As revealed by the Snowden NSA surveillance documents, HTTP traffic can also be collected and searched by government agencies without notice to users or webmasters. Given these risks, EFF believes that every website should support HTTPS on all pages as soon as possible.</p> <p> While HTTPS has long existed as the bare minimum for web security, some websites have been slow to adopt it. In part, this is because correctly and completely serving an application over HTTPS takes some care.</p> <p> This article is designed to encourage and assist website operators in implementing and improving HTTPS support. Although no precaution will defend against all threats, supporting HTTPS will protect users from a wide range of common attacks.</p> <h2> Background</h2> <p> HTTPS provides three security guarantees:</p> <ol> <li> <strong> Server authentication</strong> allows users to have some confidence that they are talking to the true application server. Without this guarantee, there can be no guarantee of confidentiality or integrity.</li> <li> <strong> Data confidentiality</strong> means that eavesdroppers cannot understand the content of the communications between the user's browser and the web server, because the data is encrypted.</li> <li> <strong> Data integrity</strong> means that a network attacker cannot damage or alter the content of the communications between the user's browser and the web server, because they are validated with a cryptographic <em> <a href="https://secure.wikimedia.org/wikipedia/en/wiki/Message_authentication_code"> message authentication code</a> </em> .</li> </ol> <p> <strong> HTTP provides no security guarantees</strong> , and applications that use it <strong> cannot possibly provide users any security</strong> . When using a web application hosted via HTTP, people have no way of knowing whether they are talking to the true application server, nor can they be sure attackers have not read or modified communications between the user's computer and the server.</p> <h2> Modes of Attack and Defense</h2> <p> However users connect to the Internet, there are a variety of people who can attack them--whether spying on them, impersonating them, tampering with their communications, or all three of these. The wifi network operator can do this; any ISP in the path between client and server can do it; anyone who can reconfigure the wifi router or another router can do it; and often, anyone else using the same network can do it, too.</p> <p> <a href="http://codebutler.com/firesheep-a-day-later/"> Firesheep</a> is an example of a <em> passive network attack</em> : it eavesdrops on the contents of network communications between browser and server, but does not re-route or modify them. Government surveillance programs such as <a href="http://www.theguardian.com/world/2013/jul/31/nsa-top-secret-program-online-data"> XKeyscore</a> also use passive attacks on HTTP traffic to collect massive amounts of online communication data.</p> <p> By contrast, other freely-available tools perform <em> active network attacks</em> , in which the attacker does modify the contents of and/or re-route communications. These tools range from serious, such as <a href="http://www.thoughtcrime.org/software/sslstrip/"> sslstrip</a> , to silly, like <a href="http://www.ex-parrot.com/pete/upside-down-ternet.html"> the Upside-Down-Ternet</a> . Although Upside-Down-Ternet is a funny prank, it is technically identical to potentially more damaging attacks such as an attack that injects malicious code or incorrect information into web pages; at the same time, it shows that such attacks are easy enough to be jokes. Free wifi hotspots have been known to inject advertisements dynamically into web pages that users read--indicating that active network attacks are a viable business model. Tools like <a href="http://www.oxid.it/cain.html"> Cain and Abel</a> enable a range of attacks, including re-routing local network traffic through the attacker's system. (Also see <a href="http://arpspoof.sourceforge.net/"> Arpspoof</a> and <a href="http://www.monkey.org/%7Edugsong/dsniff/"> dsniff</a> .)</p> <p> Only a mechanism that provides (at least) authentication, confidentiality, and integrity can defend against a range of attacks. HTTPS is currently our best option for web applications.</p> <p> However, there are some potential pitfalls that site operators must avoid in order to deploy HTTPS securely.</p> <h2> Mixed Content</h2> <p> When hosting an application over HTTPS, there can be no <em> mixed content</em> ; that is, all content in the page must be fetched via HTTPS. It is common to see partial HTTPS support on sites, in which the main pages are fetched via HTTPS but some or all of the media elements, stylesheets, and JavaScript in the page are fetched via HTTP.</p> <p> This is unsafe because although the main page load is protected against active and passive network attack, none of the other resources are. If a page loads some JavaScript or CSS code via HTTP, an attacker can provide a false, malicious code file and take over the page's DOM once it loads. Then, the user would be back to a situation of having no security. This is why all mainstream browsers warn users about pages that load mixed content. Nor is it safe to reference images via HTTP: What if the attacker swapped the Save Message and Delete Message icons in a webmail app?</p> <p> <strong> You must serve the entire application domain over HTTPS.</strong> Redirect HTTP requests with HTTP 301 or 302 responses to the equivalent HTTPS resource.</p> <p> Some site operators provide only the login page over HTTPS, on the theory that only the user's password is sensitive. These sites' users are <a> vulnerable to passive and active attacks</a> .</p> <p> Unfortunately, many sites today load content from external sites and CDN's that do not support HTTPS. If it's not possible to serve these resources from your own host or another one that supports HTTPS, you should urge these other sites to start supporting HTTPS immediately.</p> <h2> Security and Cookies</h2> <p> As Chris Palmer described in a <a href="https://www.isecpartners.com/media/12009/web-session-management.pdf"> paper on secure session management for web applications</a> , site operators must scope sensitive cookies (such as cookies used for user authentication) to the secure origin. If a cookie is broadly scoped (with the Domain attribute in the Set-Cookie: header), it may "leak" to other hosts or applications in the same domain--potentially less-secure hosts or applications.</p> <p> Similarly, the application must set the Secure attribute on the cookie when setting it. This attribute instructs the browser to send the cookie only over secure (HTTPS) transport, never insecure (HTTP).</p> <h2> Use HTTP Strict Transport Security</h2> <p> <a href="https://en.wikipedia.org/wiki/Strict_Transport_Security"> HTTP Strict Transport Security</a> (HSTS) is an HTTP protocol extension that enables site operators to instruct browsers to expect the site to use HTTPS.</p> <p> Although not all browsers yet support HSTS, EFF urges those that don't--we're looking especially at you, Apple and Microsoft--to follow the lead Google, Opera, and Mozilla have set by adopting this useful security mechanism. Indeed, ultimately we expect HTTPS (and possibly newer protocols such as <a href="https://en.wikipedia.org/wiki/SPDY"> SPDY</a> and <a href="https://en.wikipedia.org/wiki/QUIC"> QUIC</a> ) to replace HTTP entirely, the way SSH replaced Telnet and rsh.</p> <p> As an extra precaution, your site should support HSTS preloading, which prevents interception of an HTTP request if the browser hasn't yet received a valid HSTS header from the server. HSTS preloading is implemented via an opt-in list of domains that is included in Chromium, Google Chrome, and Firefox. See <a href="http://www.chromium.org/sts"> Chromium's page</a> for instructions on getting your site added to this list. Note that you must also send an HSTS header with a max-age greater value than 18 weeks for Firefox to include your site in their HSTS preload list.</p> <p> We recently enabled HSTS and HSTS preloading for eff.org. It took less than an hour to set up, and we found a way to do it without forcibly redirecting users to HTTPS, so we can state an unequivocal preference for HTTPS access while still making the site available in HTTP. It worked like a charm and a significant fraction of our users are now automatically accessing our site in HTTPS, perhaps without even knowing it.</p> <h2> Choose Strong Protocols and Cipher Suites</h2> <p> Here is a brief list of recommendations for choosing secure protocols and cipher suites in an SSL deployment:</p> <ul> <li> Disable support for SSLv2, SSLv3, and TLS 1.0.</li> <li> Support TLS 1.1 and 1.2.</li> <li> Disable NULL, aNULL, and eNULL ciphersuites, which do not offer both encryption and authentication.</li> <li> Use private keys that are at least as secure as a 2048-bit RSA key.</li> <li> Prefer ciphersuites that include <b> ephemeral Diffie-Hellman key exchange</b> . These offer the important property of <a href="https://www.eff.org/deeplinks/2013/08/pushing-perfect-forward-secrecy-important-web-privacy-protection"> Perfect Forward Secrecy</a> , which prevents decryption of past web traffic if your SSL private key is compromised in the future.</li> <li> Disable ciphersuites with keys sizes smaller than 128 bits for encryption.</li> <li> Disable ciphersuites that use MD5 for hashing. SHA-1 is also discouraged but may be required for compatibility with TLS 1.0 and SSLv3.</li> <li> Disable ciphersuites that use RC4 for encryption. AES-CBC is preferable to RC4 but vulnerable to the <a href="https://www.imperialviolet.org/2011/09/23/chromeandbeast.html"> BEAST</a> attack. Thus, AES-GCM is often recommended.</li> <li> Disable TLS compression in order to prevent the <a href="https://en.wikipedia.org/wiki/CRIME_%28security_exploit%29"> CRIME attack</a> .</li> <li> Only support secure TLS renegotiations compliant with <a href="http://www.ietf.org/rfc/rfc5746.txt"> RFC 5746</a> , or disable TLS renegotiations entirely.</li> </ul> <p> A useful tool for testing for well-known weaknesses in an existing HTTPS deployment is Qualys's <a href="https://www.ssllabs.com/ssltest/"> SSL Server Test</a> .</p> <h2> Performance Concerns</h2> <p> Many site operators report that they can't move to HTTPS for performance reasons. However, most people who say this have not actually measured any performance loss, may not have measured performance at all, and have not profiled and optimized their site's behavior. Usually, sites have latency far higher and/or throughput far lower than necessary even when hosting over HTTP--indicating HTTPS is not the problem.</p> <p> The crux of the performance problem is usually at the content layer, and also often at the database layer. Web applications are fundamentally I/O-bound, after all. Consider <a href="http://gmailblog.blogspot.com/2008/05/need-for-speed-path-to-faster-loading.html"> this wisdom from the Gmail developers</a> :</p> <blockquote> <p> First, we listed every transaction between the web browser and Google's servers, starting with the moment the "Sign in" button is pressed. To do this, we used a lot of different web development tools, like <a href="http://httpwatch.com/"> Httpwatch</a> , <a href="http://www.wireshark.org/"> WireShark</a> , and <a href="http://www.fiddlertool.com/fiddler/"> Fiddler</a> , plus our own performance measuring systems. [...]</p> <p> We spent hours poring over these traces to see exactly what was happening between the browser and Gmail during the sign-in sequence, and we found that there were between fourteen and twenty-four HTTP requests required to load an inbox and display it. To put these numbers in perspective, a popular network news site's home page required about a 180 requests to fully load when I checked it yesterday. But when we examined our requests, we realized that we could do better. We decided to attack the problem from several directions at once: reduce the number of overall requests, make more of the requests cacheable by the browser, and reduce the overhead of each request.</p> <p> We made good progress on every front. We reduced the weight of each request itself by eliminating or narrowing the scope of some of our cookies. We made sure that all our images were cacheable by the browser, and we consolidated small icon images into single meta-images, a technique known as spriting. We combined several requests into a single combined request and response. The result is that it now takes as few as four requests from the click of the "Sign in" button to the display of your inbox.</p> </blockquote> <p> Google's <a href="http://www.imperialviolet.org/2010/06/25/overclocking-ssl.html"> Adam Langley provides additional detail</a> :</p> <blockquote> In order to do this we had to deploy <em> no additional machines</em> and <em> no special hardware</em> . On our production frontend machines, SSL/TLS accounts for less than 1% of the CPU load, less than 10KB of memory per connection and less than 2% of network overhead. Many people believe that SSL takes a lot of CPU time and we hope the above numbers (public for the first time) will help to dispel that. [emphasis in original]</blockquote> <p> Is it any wonder Gmail performs well, even when using HTTPS exclusively? Site operators can realize incremental improvement by gradually tuning their web applications. Chris gave a presentation to this effect at <a href="http://assets.en.oreilly.com/1/event/22/High%20Performance,%20Low%20Cost,%20and%20Strong%20Security_%20Pick%20Any%20Three%20Presentation.pdf"> Web 2.0 Expo 2009</a> .</p> <h2> Conclusion</h2> <p> HTTPS provides the baseline of safety for web application users, and there is no performance- or cost-based reason to stick with HTTP. Web application providers <a href="http://papers.ssrn.com/sol3/papers.cfm?abstract_id=1421553"> undermine their business models</a> when, by continuing to use HTTP, they enable a wide range of attackers anywhere on the internet to compromise users' information.</p>
tr: <p class="eff-light-blue eff-grey"><a href="http://noncombatant.org"> Chris Palmer</a> ve <a href="/about/staff/yan-zhu"> Yan Zhu</a> tarafından yazılmıştır</p> <p><em>Makale 15 Kasım 2010 tarihinde yayımlanmıştır. 12 Aralık 2013 tarihinde revize edilmiştir.</em></p> <p>İnternet teknologları, HTTP'nin güvensiz olduğunun ve kullanıcılara karşı birçok risk oluşturduğunun uzun süredir farkındaydı. HTTP üzerinden gönderilen trafik şifresiz olduğu için, HTTP üzerinden gönderilen her veri ağa erişimi olan herhangi biri tarafından okunabilir ya da modifiye edilebilir. Snowden'ın sağladığı NSA dökümanlarında da görüldüğü gibi, HTTP trafiği devlet ajansları tarafından kullanıcı ya da webmasterlar uyarılmadan toplanabiliyor. Bu riskler göz önüne alındığında, EFF tüm sitelerin bir an önce HTTPS kullanması gerektiğine inanıyor.</p> <p>HTTPS, temel web güvenliği için uzun bir süredir varolmasına karşın, bazı siteler HTTPS'i desteklemekte yavaş kaldılar. Düzgün ve komple olarak bir uygulamayı HTTPS üzerinden sunmanın gerektirdiği ilgi, bunun sebeplerinden biri.</p> <p>Bu makale, HTTPS desteğini uygulamak ve geliştirmek isteyen site operatörlerini cesaretlendirmek ve onlara yardımcı olmak için tasarlanmıştır. Hiçbir önlem sizi bütün tehditlere karşı koruyamaz, ancak HTTPS'i desteklemek kullanıcılarınızı yaygınlaşmış saldırılara karşı koruyacaktır.</p> <h2>Arkaplan</h2> <p>HTTPS üç farklı güvenlik garantisi verir:</p> <ol><li><strong>Sunucu kimliğinin doğrulanması</strong>, kullanıcılara doğru uygulama sunucusuyla konuştukları güvencesini az da olsa sağlar. Bu garanti olmadan, gizliliğin ya da bütünlüğün (integrity) garantisi mümkün değildir.</li><li> <strong>Veri gizliliği</strong>, veri şifreli olduğu için, kullanıcının tarayıcısı ve web sunucusu arasındaki iletişimin içeriğinin başkaları tarafından dinlenemeyeceği anlamına gelir.</li><li> <strong>Veri bütünlüğü</strong>, veriler kriptografik <em><a href="https://secure.wikimedia.org/wikipedia/en/wiki/Message_authentication_code">mesaj doğrulama kodu</a></em>yla doğrulandığı için, kullanıcının tarayıcısı ve web sunucusu arasındaki iletişimin içeriğinin, ağa saldıran biri tarafından hasar göremeyeceği ya da içeriğinin değiştirilemeyeceği anlamına gelir.</li></ol> <p><strong>HTTP ve bunu kullanan uygulamalar kullanıcılarına herhangi bir güvenli garantisi sağlayamaz</strong>. HTTP tarafından sunulan bir uygulama kullanıldığında, insanların doğru uygulama sunucusuyla konuştuklarını ya da saldırganların kullanıcının bilgisayarı ve sunucusu arasındaki iletişimi okumadığını ya da modifiye etmediğini anlamanın bir yolu yoktur.</p> <h2>Saldırı ve Savunma Yöntemleri</h2> <p>Kullanıcılar internete nasıl bağlanırsa bağlansın, insanların onlara saldırmasının farklı yolları vardır (kullanıcıları izlemek, taklit etmek, iletişimine müdahale etmek ya da bunların tümü gibi). WiFi ağ operatörleri, kullanıcı ve sunucu arasında olan herhangi bir ISS, bir WiFi router'ını ya da başka bir router'ı yeniden ayarlayabilecek biri, ve sıkça, aynı ağı kullanan biri bu saldırıları gerçekleştirebilir.</p> <p><a href="http://codebutler.com/firesheep-a-day-later/">Firesheep</a>, pasif ağ saldırısının örneklerinden biridir: tarayıcı ve sunucu arasındaki ağ iletişiminin içeriğini dinler, ancak bu iletişimi yeniden yönlendirmez ya da modifiye etmez. <a href="http://www.theguardian.com/world/2013/jul/31/nsa-top-secret-program-online-data">XKeyscore</a> gibi devlet gözetim programları, HTTP trafiğine yapılan pasif ataklar sayesinde devasa boyuttaki online iletişim verilerini toplarlar.</p> <p>Bununla birlikte, halihazırda mevcut olan diğer araçlar <em>aktif ağ saldırıları</em>nı gerçekleştirir. Bu saldırılarda saldırgan iletişimin içeriğini modifiye eder ve/veya iletişimi yeniden yönlendirir. Bu araçların <a href="http://www.thoughtcrime.org/software/sslstrip/">sslstrip</a> gibi ciddi olanları olduğu kadar, <a href="http://www.ex-parrot.com/pete/upside-down-ternet.html">Upside-Down-Ternet</a> gibi aptalca olanları da vardır. Upside-Down-Ternet komik bir şakadan ibaret olsa da, zararlı bir kod ya da web sitelerine yanlış bilgiler ekleyen ve hasar verme potansiyeli olan diğer saldırılara teknik olarak benzerlik gösterir. Aynı zamanda bu tarz saldırıların şaka olabilecek kadar kolay olduğunu gözler önüne serer. Ücretsiz WiFi noktalarının, ağ saldırılarını geçerli bir iş modeli gibi görürcesine, kullanıcılarının okuduğu web sayfalarına reklam eklediği bilinen bir şeydir. <a href="http://www.oxid.it/cain.html">Cain and Abel</a> gibi araçlar, yerel ağ trafiğini saldırganın sistemine yeniden yönlendirmek gibi farklı saldırı aralıklarına olanak sağlar. (Aynı zamanda <a href="http://arpspoof.sourceforge.net/">Arpspoof</a> ve <a href="http://www.monkey.org/%7Edugsong/dsniff/">dsniff</a>'e de göz atın.)</p> <p>Yalnızca (en azından) doğrulama, gizlilik ve bütünlük sağlayan bir mekanizma saldırı aralıklarına karşı savunma sağlayabilir. Web uygulamaları için şu anki en iyi seçenek HTTPS'dir.</p> <p>Ancak, site operatörlerinin HTTPS'i güvenli bir şekilde uygularken dikkat etmesi gereken birkaç potansiyel tuzak vardır.</p> <h2>Karışık İçerik</h2> <p>Bir uygulamayı HTTPS üzerinden sunuyorsanız, karışık içerik kullanmamalısınız. Bunun için sayfadaki içeriğin hepsi HTTPS aracılığıyla yakalanmalıdır. Kısmi HTTPS desteğini sitelerde görmek oldukça sık rastlanan bir durumdur. Ana sayfalar HTTPS aracılığıyla yakalanır, ancak sayfa üzerindeki medya elementleri, stylesheet'ler ve JavaScript HTTP üzerinden yakalanır.</p> <p>Bu güvensizdir çünkü ana sayfa her ne kadar aktif ve pasif ağ saldırılarına karşı korunuyor olsa da, sayfa üzerindeki diğer kaynaklar korunaksızdır. Eğer bir sayfa HTTP üzerinden JavaScript veya CSS yüklüyorsa, bir saldırgan yanlış, zararlı bir kodu sayfaya enjekte edebilir ve sayfanın DOM'unun kontrolünü yüklendikten sonra ele geçirebilir. Bunun sonucunda kullanıcı herhangi bir güvenliği olmadığı eski duruma geri döner. Bu yüzden yaygın olan tarayıcıların hepsi, kullanıcılarını karışık içerik yükleyen sayfalara karşı uyarır. HTTP üzerinden görüntülere referans vermek de güvenli değildir: ya bir saldırgan bir webmail uygulamasındaki "Mesajı Kaydet" ve "Mesajı Sil" ikonlarının yerini değiştirirse?</p> <p><strong>Uygulama alanının tamamını HTTPS üzerinden vermelisiniz.</strong> HTTP isteklerini HTTP 301 ve 302 cevaplarıyla birlikte eşdeğer HTTPS kaynağına yönlendirin.</p> <p>Bazı site operatörleri, sadece kullanıcının şifresinin hassas bir bilgi olduğu düşüncesinden hareketle, sitelerinin yalnızca giriş (sign in) sayfalarını HTTPS üzerinden verirler. Bu siteler kullanıcılarını pasif ve aktif saldırılara karşı savunmasız bırakır.</p> <p>Bugün birçok site maalesef HTTPS'i desteklemeyen harici sitelerden ve CDN'lerden (Content Delivery Network) içerik yüklemektedir. Bu içerikleri kendi sunucunuzdan ya da HTTPS destekleyen başka bir sunucudan vermeniz mümkün değilse, içeriğini sunduğunuz diğer siteleri HTTPS desteklemeye teşvik etmelisiniz.</p> <h2>Güvenlik ve Çerezler</h2> <p>Chris Palmer'ın <a href="https://www.isecpartners.com/media/12009/web-session-management.pdf">web uygulamaları için güvenli seans yönetimi</a>yle ilgili makalesinde de anlattığı gibi, site operatörleri hassas çerezlerin (kullanıcı doğrulaması için kullanılan çerezler gibi) faaliyet alanını güvenli kaynağa genişletmelidir. Eğer bir çerezin faaliyet alanı genişse (Set-Cookie: header'daki Domain özniteliğiyle birlikte), çerez potansiyel olarak daha az güvenli olan aynı domain'deki başka bir sisteme ya da uygulamaya "sızabilir".</p> <p>Benzer olarak, uygulama kurulum sırasında Secure özniteliğini (attribute) çereze tayin etmelidir. Bu öznitelik, tarayıcıya çerezin yalnızca güvenli (HTTPS) taşıma üzerinden gönderilmesi bilgisini verir.</p> <h2>HTTP Strict Transport Security'i Kullanın</h2> <p><a href="https://en.wikipedia.org/wiki/Strict_Transport_Security">HTTP Strict Transport Security</a> (HSTS), site operatörlerinin tarayıcılara sitenin HTTPS kullanmasını beklemeleri bilgisini veren bir HTTP protokol eklentisidir.</p> <p>HSTS şu an için tüm tarayıcılar tarafından desteklenmese de, EFF olarak HSTS desteği sağlamayan firmaların (özellikle size söylüyoruz, Apple ve Microsoft) bu kullanışlı güvenlik mekanizmasını uygulamaya koyan Google, Opera ve Mozilla gibi firmaların izinden gitmesini arzuluyoruz. HTTPS'in (ve <a href="https://en.wikipedia.org/wiki/SPDY">SPDY</a> ya da <a href="https://en.wikipedia.org/wiki/QUIC">QUIC</a> gibi daha yeni protokollerin) eninde sonunda, tıpkı SSH'in Telnet ve rsh'in yerine geçtiği gibi, HTTP'nin yerine geçmesini bekliyoruz.</p> <p>Ek bir önlem olarak, siteniz HSTS önyüklemesini desteklemelidir. HSTS önyüklemesi, eğer tarayıcınız sunucudan geçerli bir HSTS üstbilgisi almadıysa, bir HTTP isteğinin dinlenmesini engeller. HSTS önyüklemesi Chromium, Google Chrome ve Firefox'ta yer alan dahili bir domain listesi aracılığıyla eklenmiştir. Sitenizi bu listeye eklemek için takip etmeniz gereken adımları öğrenmek için <a href="http://www.chromium.org/sts">Chromium'un sayfasına</a> göz atın. Firefox'un HSTS önyükleme listesine dahil olmak için, max-age değeri 18 haftadan büyük olan bir HSTS üstbilgisi yollamanız gerektiğini unutmayın.</p> <p>HSTS ve HSTS önyüklemesini eff.org için yakın bir zaman önce aktif hale getirdik. Kurulum bir saat kadar sürdü ve bunu kullanıcıları zorla HTTPS'e yönlendirmeden yapmanın bir yöntemini bulduk. Bunu yapmamızın sebebi, HTTPS erişimini net bir şekilde belirtirken, siteyi aynı zamanda HTTP olarak da sunabilmekti. Bu yöntem sorunsuz bir şekilde çalıştı ve kullanıcılarımızın büyük çoğunluğu, belki de bilinçsizce, sitemizi artık otomatik olarak HTTPS kullanarak ziyaret ediyor.</p> <h2>Güçlü Protokolleri ve Cipher Suite'leri Seçin</h2> <p>SSL uygularken seçeceğiniz güçlü protokoller ve cipher suite'leriyle ilgili kısa bir tavsiye listesi şöyledir:</p> <ul> <li>SSLv2, SSLv3 ve TLS 1.0 için desteği devre dışı bırakın.</li> <li>TLS 1.1 ve 1.2'yi destekleyin.</li> <li>Şifreleme ve doğrulama desteği vermeyen NULL, aNULL ve eNULL cipher suite'lerini devre dışı bırakın.</li> <li>En az 2048-bit RSA anahtarı kadar güvenli olan bir gizli anahtar kullanın.</li> <li><b>Kısa ömürlü Diffie-Hellman anahtar değişimi</b>ni içeren cipher suite'lerini tercih edin. Bunlar <a href="https://www.eff.org/deeplinks/2013/08/pushing-perfect-forward-secrecy-important-web-privacy-protection">Perfect Forward Secrecy</a> isminde önemli bir özellik sunar ve bu özellik gizli SSL anahtarınızın güvenliği gelecekte ihlal edilmiş olsa bile geçmişteki web trafiğinizin şifresinin çözülmesini engeller.</li> <li>Şifreleme için anahtar boyutu 128 bit'ten küçük olan cipher suite'leri devre dışı bırakın.</li> <li>Hashing için MD5 kullanan cipher suite'leri devre dışı bırakın. SHA-1'i kullanmanızı tavsiye etmiyoruz ancak SHA-1, TLS 1.0 ve SSLv3 uyumluluğu için gerekli olabilir.</li> <li>RC4 şifrelemesini kullanan cipher suite'leri devre dışı bırakın. RC4 yerine AES-CBC tercih edilebilir ancak AES-CBC <a href="https://www.imperialviolet.org/2011/09/23/chromeandbeast.html">BEAST</a> isimli saldırıya karşı korunmasızdır. Bu yüzden genellikle AES-GCM tavsiye edilir.</li> <li><a href="https://en.wikipedia.org/wiki/CRIME_%28security_exploit%29">CRIME</a> saldırısını önlemek için TLS sıkıştırmasını (compression) devre dışı bırakın.</li> <li>Yalnızca RFC 5746 uyumlu güvenli TLS yeniden anlaşmalarını (renegotiation) destekleyin ya da TLS yeniden anlaşmalarını tamamen devre dışı bırakın.</li> </ul> <p>Varolan HTTPS uygulamasındaki zayıflıkları test etmek için Qualys'in meşhur <a href="https://www.ssllabs.com/ssltest/">SSL Server Test</a>'ini kullanın.</p> <h2>Performans Endişeleri</h2> <p>Birçok site operatörü, HTTPS'e performans sebeplerinden ötürü geçmediğini belirtir. Ancak bunu söyleyen insanlar gerçekte herhangi bir performans kaybı ölçmemiştir (hatta hiç performans ölçümü yapmamış bile olabilirler) ve sitelerinin davranışının profilini çıkarmamış ve performansını optimize etmemişlerdir. Siteler genellikle HTTP üzerinden sunum yaptığında, gerekli olandan çok daha yüksek gecikme süresine ve/veya düşük veri hacmine (throughput) sahiptirler, bu da problemin HTTPS'te olmadığını gösterir.</p> <p>Performans probleminin kaynağı içerik katmanı ve genellikle veritabanı katmanıdır. Ne de olsa web uygulamaları temelde girdi-çıktıya (I/O) bağlıdır. <a href="http://gmailblog.blogspot.com/2008/05/need-for-speed-path-to-faster-loading.html">Gmail geliştiricilerinin verdiği şu tavsiyeye dikkat edin:</p> <blockquote><p>İlk önce, "Sign in" (Giriş) butonuna basılmasıyla başlayan web tarayıcısı ve Google sunucuları arasında gerçekleşen her işlemin listesini çıkardık. Bunu yapmak için <a href="http://httpwatch.com/">Httpwatch</a>, <a href="http://www.wireshark.org/">WireShark</a> ve <a href="http://www.fiddlertool.com/fiddler/">Fiddler</a> gibi birçok web geliştirme aracını ve kendi geliştirdiğimiz performans ölçme sistemlerini kullandık. [...]</p> <p>Sign-in işlemi sırasında Gmail ve tarayıcı arasında neler gerçekleştiğini görebilmek için saatlerce topladığımız bu izlere dikkat ettik ve bir gelen kutusunun yüklenmesi ve görüntülenmesi için 14-24 arası HTTP isteğinin gerektiğini tespit ettik. Bu sayıları bir perspektife yerleştirmek gerekirse, popüler bir ağ haberleri sitesinin ana sayfasının tamamen yüklenmesi için dün tıkladığımda 180 tane istek gerekiyordu. Bu probleme birkaç yönden aynı anda saldırmaya karar verdik: istek sayısını azalt, isteklerin daha fazlasının tarayıcı tarafından önbelleğe atılmasını sağla ve her isteğin overhead'ini azalt.</p> Üç alanda da iyi gelişmeler kaydettik. Her isteğin ağırlığını bazı çerezlerimizin faaliyet alanını daraltarak ya da elimine ederek azalttık. Her görüntünün tarayıcı tarafından önbelleğe atıldığından emin olduk ve spriting olarak da bilinen küçük ikon görüntülerini tek bir meta-görüntüyle birleştirdik. Birkaç isteği birleştirerek, bunları tek bir birleştirilmiş isteğe ve cevaba dönüştürdük. Bunun sonucunda artık "Sign in" butonuna tıklayıp gelen kutunuza ulaşmak için yalnızca 4 istek gerekiyor.</p></blockquote> <p>Google çalışanı Adam Langley ek bilgiler sağlıyor:</p> <blockquote>Bunu yapabilmek için <em>ek bir makine</em> ya da <em>özel bir donanım</em> kullanmadık. SSL/TLS, frontend üretim makinelerimizde CPU yükünün %1'inden, network overhead'in %2'sinden ve bağlantı başına belleğin 10KB'ından sorumlu. Birçok insan SSL'in CPU'yu çok kullandığını düşünüyor ve biz ilk defa halka açıkladığımız bu sayıların bu düşünceyi yok edeceğini umuyoruz.</blockquote> <p>Yalnızca HTTPS kullandığında bile Gmail'in iyi çalıştığı şaşılacak bir şey mi? Site operatörleri web uygulamalarını yavaş yavaş ayarlayarak kademeli gelişimin farkına varabilir. Chris bu konuyla ilgili Web 2.0 Expo 2009'da <a href="http://assets.en.oreilly.com/1/event/22/High%20Performance,%20Low%20Cost,%20and%20Strong%20Security_%20Pick%20Any%20Three%20Presentation.pdf">bir sunum yapmıştı</a>.</p> <h2>Sonuç</h2> <p>HTTPS, web uygulaması kullanıcıları için güvenliğin temelini sağlar ve HTTP kullanmaya devam etmenin performans ya da maliyet temelli bir sebebi yoktur. Web uygulaması sağlayıcıları, HTTP kullanmaya devam ederek <a href="http://papers.ssrn.com/sol3/papers.cfm?abstract_id=1421553">kendi iş modellerini baltalarlar</a> ve internetin herhangi bir yerinde geniş saldırı aralıklarına izin vererek kullanıcıların bilgilerini tehlikeye atarlar.</p>
