Repository: EFForg/www-l10n
Catalog: translations/*/JobID35_*.xlf
Languages: tr

# 637][title_field][0][value
source: How to Deploy HTTPS Correctly
tr: HTTPS Doğru Bir Şekilde Nasıl Uygulanır
