Repository: EFForg/www-l10n
Catalog: translations/*/JobID45_*.xlf
Languages: it

# 887][field_questions][13][answer
source: <a id="safari_and_ie"></a>In the near future we hope to release Privacy Badger for Opera, Safari, and Firefox Mobile. Unfortunately at the moment we cannot support Internet Explorer, since current version IE appears to be incompatible with how Privacy Badger works at a technical level. (With that said, if you would like to work on porting Privacy Badger to other platforms, please let us know!)
it: <a id="safari_and_ie"></a>In futuro speriamo di rilasciare Privacy Badger per Opera, Safari, e Firefox Mobile. Purtroppo al momento non possiamo supportare Internet Explorer, dalla versione corrente IE sembra essere incompatibile con il funzionamento di Privacy Badger a livello tecnico. (Detto ciò, se si desidera lavorare su Privacy Badger riguardo il porting su altre piattaforme, fatecelo sapere!)

# 887][field_questions][14][question
source: Can I download Privacy Badger outside of the Chrome Web Store?
it: Posso scaricare Badger Privacy fuori dal Chrome Web Store?

# 887][field_questions][14][answer
source: <a id="no_chrome_store"></a>You can! If you are using an alternative Chromium based browser such as Chromium ports Iron, Comodo Dragon, or Maxthon you can get the latest version of the addon directly from this link: <a href="https://www.eff.org/files/privacy_badger-chrome.crx">https://www.eff.org/files/privacy_badger-chrome.crx</a>
it: <a id="no_chrome_store"></a>SI! Se usi una versione alternativa di chrome come le ports di Chromium Iron, Comodo Dragon, o Maxthon puoi scaricare una versione da questo link: <a href="https://www.eff.org/files/privacy_badger-chrome.crx">https://www.eff.org/files/privacy_badger-chrome.crx</a>

# 887][field_questions][15][question
source: I am an online advertising / tracking company. How do I stop Privacy Badger from blocking me?
it: Io sono un inserzionista o un’azienda di tracking. Come impedisco a Privacy Badger di bloccarmi?

# 887][field_questions][15][answer
source: <a id="how_to_comply_with_dnt"></a>One way is to stop tracking third party users who have turned on the Do Not Track header (i.e., stop collecting cookies, supercookies or fingerprints from them). That will work for new Privacy Badger installs. If copies of Privacy Badger have already blocked your domain, you can unblock yourself by promising to respect the Do Not Track header in a way that conforms with the user's privacy policy. You can do that by posting a specific compliant <a href="https://www.eff.org/dnt-policy" target="_blank">DNT policy</a> to the URL <tt>http<b>s</b>://example.com/.well-known/dnt-policy.txt</tt>, where "example.com" is all of your DNT-compliant domains. Note that the domain <i>must</i> support HTTPS, to protect against tampering by network attackers. The path contains ".well-known" per <a href="https://tools.ietf.org/html/rfc5785">RFC 5785</a>. Privacy Badger currently checks for this specific <i>verbatim</i> policy document, though in the future Privacy Badger may allow content from sites that post different versions of a <a href="/dnt-policy">compliant DNT Policy</a>, and that there may be ways for users to specify their own acceptable DNT policies if they wish to.
it: <a id="how_to_comply_with_dnt"></a>Un modo è smettere di tracciare gli utenti che hanno attivato l’header Do Not Track (per esempio, smettete di raccogliere cookies, supercookies o fingerprints). Questo vale per le nuove installazioni di Privacy Badger. Se copie di Privacy Badger hanno già bloccato il tuo dominio, è possibile sbloccarti promettendo di rispettare l'intestazione di non tracciabilità in un modo che sia conforme alla politica sulla privacy dell'utente. Puoi pubblicare un criterio specifico <a href="https://www.eff.org/dnt-policy" target="_blank">DNT policy</a> per l’URL <tt>http<b>s</b>://example.com/.well-known/dnt-policy.txt</tt>, dove "example.com" sono tutti i domini DNT-compliant. Considera che il dominio <i>deve</i> supportare HTTPS, per proteggere dalla possibilità di attacchi informatici. La path contiene ".well-known" per <a href="https://tools.ietf.org/html/rfc5785">RFC 5785</a>. Privacy Badger attualmente cerca specifiche policy<i>verbatim</i>, comunque in futuro Privacy Badger potrà permettere contenuti da siti che pubblicheranno <a href="/dnt-policy"> DNT Policy</a>, e sarà possibile per gli utenti scegliere quali policy accettare.

# 887][field_questions][16][question
source: What is the Privacy Badger license? Where is the Privacy Badger source code?
it: Qual è la licenza di Privacy Badger? Dov’è il codice sorgente di Privacy Badger?

# 887][field_questions][16][answer
source: <a id="license"></a>Privacy Badger is GPLv3 code, the Chrome version is based on a modified version of the AdBlock Plus engine. You can find the Privacy Badger source trees <a href="https://github.com/EFForg/">on Github</a>. There is also a <a href="https://lists.eff.org/mailman/listinfo/privacybadger">development mailing list</a>. Privacy Badger is governed by EFF's <a href="/code/privacy">Privacy Policy for Software</a>. <a name="comparison"></a>
it: <a id="license"></a>Privacy Badger è GPLv3 code, la versione di Chrome è basata sul motore di AdBlock Plus. Puoi trovare Privacy Badger <a href="https://github.com/EFForg/">su Github</a>. C’è anche una <a href="https://lists.eff.org/mailman/listinfo/privacybadger">development mailing list</a>. Privacy Badger rispetta la <a href="/code/privacy">Privacy Policy for Software</a> di EFF’s. <a name="comparison"></a>

# 887][field_questions][17][question
source: I found a bug! What do I do now?
it: Ho trovato un bug! Cosa devo fare?

# 887][field_questions][17][answer
source: <a id="i_found_a_bug"></a>First, please make sure the bug hasn't already been reported by checking the current bug list <a href="https://github.com/EFForg/privacybadgerfirefox/issues">for Firefox</a> or <a href="https://github.com/EFForg/privacybadgerchrome/issues">for Chrome</a>. If the bug hasn't yet been reported you can report the bug <a href="https://github.com/EFForg/privacybadgerfirefox/issues/new">here for Privacy Badger for Firefox</a> or <a href="https://github.com/EFForg/privacybadgerchrome/issues/new">here for Privacy Badger for Chrome</a>. If you don't have a GitHub account, then you can login using the anonymous one: "cypherpunk"/"cypherpunk", but please understand that doing so will limit our ability to communicate with you about the bug and make it harder for us to fix it quickly.
it: <a id="i_found_a_bug"></a>Prima di tutto, per favore accertati che non sia già noto guardando le buglist <a href="https://github.com/EFForg/privacybadgerfirefox/issues">per Firefox</a> o <a href="https://github.com/EFForg/privacybadgerchrome/issues">per Chrome</a>. Se non è ancora stato segnalato puoi farlo tu stesso <a href="https://github.com/EFForg/privacybadgerfirefox/issues/new">qui per Privacy Badger per Firefox</a> o <a href="https://github.com/EFForg/privacybadgerchrome/issues/new">qui per Privacy Badger per Chrome</a>. Se non hai un account GitHub, allora puoi effettuare il login utilizzando quello anonimo: "cypherpunk" / "cypherpunk", ma vi prego di capire che facendo così limiterete la nostra capacità di comunicare con voi circa il bug e renderete più difficile per noi per risolvere il problema rapidamente.

# 887][field_questions][18][question
source: How can I support Privacy Badger?
it: Come posso supportare Privacy Badger?

# 887][field_questions][18][answer
source: <a id="support"></a>Thanks for asking! Individual donations make up about half of EFF's support, which gives us the freedom to work on user-focused projects. If you want to support the development of Privacy Badger and other projects like it, helping build a more secure Internet ecosystem, you can <a href="https://supporters.eff.org/donate/support-privacy-badger">throw us a few dollars here</a>. Thank you. If you want to help with the code we appreciate that as well. Here are the lists of good volunteer tasks <a href="https://github.com/EFForg/privacybadgerfirefox/issues?q=is%3Aopen+is%3Aissue+label%3A%22Good+Volunteer+Task%22" target="_blank">[firefox]</a> <a href="https://github.com/EFForg/privacybadgerchrome/issues?q=is%3Aopen+is%3Aissue+label%3A%22Good+Volunteer+Task%22" target="_blank">[chrome]</a>.
it: <a id="support"></a>Thanks per averlo chiesto! Donazioni individuali costituiscono circa la metà del sostegno del FEP, che ci dà la libertà di lavorare su progetti orientati all'utente. If you want to support the development of Privacy Badger and other projects like it, helping build a more secure Internet ecosystem, you can <a href="https://supporters.eff.org/donate/support-privacy-badger">throw us a few dollars here</a>. Grazie! Se si vuole aiutare con il codice lo apprezzeremo. Qui ci sono delle liste di compit per <a href="https://github.com/EFForg/privacybadgerfirefox/issues?q=is%3Aopen+is%3Aissue+label%3A%22Good+Volunteer+Task%22" target="_blank">[firefox]</a> <a href="https://github.com/EFForg/privacybadgerchrome/issues?q=is%3Aopen+is%3Aissue+label%3A%22Good+Volunteer+Task%22" target="_blank">[chrome]</a>.

# 887][field_questions][19][question
source: How does Privacy Badger handle social media widgets?
it: Come gestisce Privacy Badger widget social media?

# 887][field_questions][19][answer
source: <a id="social"></a>Social media widgets (such as the Facebook Like button, Twitter Tweet button, or Google +1 button) often track your reading habits. Even if you don't click them, the social media companies often see exactly which pages you're seeing the widget on. Privacy Badger includes a feature imported from the <a href="http://sharemenot.cs.washington.edu/">ShareMeNot</a> project which is able to replace the widgets with a stand-in version, so that you can still see and click them. You will not be tracked by these replacements unless you explicitly choose to click them. Privacy Badger currently knows how to replace the following widgets if they are observed tracking you: AddThis, Facebook, Google, LinkedIn, Pinterest, Stumbleupon, and Twitter. (The source code for these replacements is <a href="https://github.com/EFForg/privacybadgerchrome/blob/master/src/socialwidgets.json">here</a>; pull requests are welcome) Note that Privacy Badger will not replace social media widgets unless it has blocked the associated tracker. If you're seeing real social media widgets, it generally means that Privacy Badger hasn't detected tracking from that variant of the widget, or that the site you're looking at has implemented its own version of the widget. To avoid confusion, the replacement widgets are marked with the Privacy Badger badge next to the button. To interact with a replacement widget, simply click on it. Depending on the widget, Privacy Badger will either send you directly to the appropriate sharing page (for example, to post a tweet) or it will enable and load the real social widget (for example, the Facebook Like button, with personalized information about how many of your friends have "liked" the page). In the second case, you will still need to interact with the real widget to "like" or share the page. <a id="connection-failure"></a>
it: <a id="social"></a>Social media widgets (come il pulsante Facebook Like, per Twitter il pulsante Tweet, o per Google il pulsante +1) spesso tracciano le tue abitudini. Anche se non li si fa clic, le aziende social spesso vedono esattamente quali pagine si stanno guardando. Privacy Badger include una speciale funzione importata da <a href="http://sharemenot.cs.washington.edu/">ShareMeNot</a> che sostiutisce il pulsante con una versione stand-alone in modo che lo si possa comunque utilizzare. Non verranno monitorati da queste sostituzioni a meno che non si sceglie in modo esplicito di fare clic su uno di loro. Privacy Badger attualmente sa come sostituire i seguenti widget: AddThis, Facebook, Google, LinkedIn, Pinterest, Stumbleupon e Twitter. (Il codice sorgente per questi rimpiazzamenti è <a href="https://github.com/EFForg/privacybadgerchrome/blob/master/src/socialwidgets.json">qui</a>; pull request sono benvenute) Si noti che Privacy Badger non bloccherà i pulsanti di social media a meno che non sia bloccato il relativo cookie. Se stai vedendo un widget vero, generalmente significa che Privacy Badger non ha rilevato il rilevamento da quella variante del widget, o che il sitoche si sta guardando ha implementato la propria versione del widget. Per evitare confusione, i widget di ricambio sono contrassegnati con il distintivo di Privacy Badger accanto al pulsante. Per interagire con un widget di sostituzione, è sufficiente fare clic su di esso. A seconda il widget, Privacy Badger invierà direttamente nella pagina condivisione appropriata (ad esempio, per inviare un tweet) o attiverà il widget social reale (ad esempio, il pulsante di Facebook Like, con informazioni personalizzate su quanti dei tuoi amici abbiano messo il "Like" alla pagina). Nel secondo caso, sarà tuttavia necessario interagire con il widget reale per mettere "Mi piace" oppure condividere la pagina. <a id="connection-failure"></a>

# 887][field_questions][20][question
source: I'm having a problem installing the browser extension.
it: Sto avendo un problema per installare l'estensione per il browser.

# 887][field_questions][20][answer
source: Some people report that installing Privacy Badger gives them the error: "The addon could not be downloaded because of a connection failure on www.eff.org." This may be caused by Avast antivirus, which blocks installation of browser extensions. You may be able to work around by right-clicking to download the .xpi file, then dragging it into Firefox to install. If that fails, you may temporarily disable Avast antivirus before installing the extension.
it: Alcune persone riferiscono che l'installazione di Privacy Badger dà loro l'errore: "L'addon non potrebbe essere scaricata a causa di un errore di connessione sul www.eff.org." Questo può essere causato da Avast antivirus, che blocca l'installazione delle estensioni del browser. Si può risolvere facendo clic destro per scaricare il file. xpi, quindi trascinandola in Firefox per installarla. Se il problema persiste, è possibile disattivare temporaneamente Avast antivirus prima di installare l'estensione.

# 887][field_questions][21][question
source: Is Privacy Badger compatible with other extensions, including other adblockers?
it: È compatibile con altre estensioni, tra cui altri adblocker?

# 887][field_questions][21][answer
source: Privacy Badger is compatible with most extensions. Whether it makes sense to run it with another adblocker varies. If you have customized your adblocker settings to block trackers as well, Privacy Badger may be partially redundant (though it may offer advantages like cookie blocking that other tracker blockers do not). However if you run extensions like Adlbock Plus or Ghostery in their default configurations, Privacy Badger can significantly increase your privacy online. (Adblock does not block invisible trackers by default, Ghostery does not block anything by default.) The only extensions known to be incompatible with Privacy Badger is the Avast anitvirus extension, which blocks the installation of Privacy Badger and other extensions. Last updated July 22nd, 2015
it: Privacy Badger è compatibile con la maggior parte delle estensioni. Non sempre ha senso eseguirlo con un altro adblocker. Se sono state personalizzate le impostazioni adblocker per bloccare tracker, Badger Privacy potrebbe essere parzialmente ridondante (anche se può offrire vantaggi come blocco che altri bloccanti non hanno). Anche se se esegui estensioni come Adlbock Plus o Ghostery nelle loro configurazioni di default, Privacy Badger può comunque aumentare il tuo livello di privacy online. (Adblock non blocca tracker invisibili di default, Ghostery non blocca niente di default.) L’unica estensione conosciuta incompatibile con Privacy Badger è Avast antivirus, che blocca l’installazione di Privacy Badger. Ultimo aggiornamento 22 Luglio 2015

# 888][field_text_field][0][value
source: A Project of the <a href="/">Electronic Frontier Foundation</a>
it: Un progetto della <a href="/">Electronic Frontier Foundation</a>

# 889][singular
source: Privacy Badger blocks spying ads and invisible trackers.
it: Privacy Badger blocca annunci pubblicitari invasivi e trackers nascosti.

# 893][singular
source: and Enable Do Not Track
it: e abilita Do Not Track

# 894][singular
source: Click here for !browser version
it: Clicca qui per la versione Browser

# 897][singular
source: Download for Firefox
it: Download per Firefox

# 898][singular
source: Download for Chrome
it: Download per Chrome
